[
  {
    "title": "Interpreting Song Lyrics with an Audio-Informed Pre-trained Language Model",
    "author": [
      "Yixiao Zhang",
      "Junyan Jiang",
      "Gus Xia",
      "Simon Dixon"
    ],
    "year": "2022",
    "doi": "10.5281/zenodo.7316584",
    "url": "https://doi.org/10.5281/zenodo.7316584",
    "ee": "https://archives.ismir.net/ismir2022/paper/000001.pdf",
    "pages": "19-26",
    "abstract": "Lyric interpretations can help people understand songs and their lyrics quickly, and can also make it easier to manage, retrieve and discover songs efficiently from the growing mass of music archives. In this paper we propose BART-fusion, a novel model for generating lyrics interpretations from lyrics and music audio that combines a large-scale pre-trained language model with an audio encoder. We employ a cross-modal attention module to incorporate the audio representation into the lyrics representation to help the pre-trained language model understand the song from an audio perspective, while preserving the language model's original generative performance. We also release the Song Interpretation Dataset, a new large-scale dataset for training and evaluating our model. Experimental results show that the additional audio information helps our model to understand words and music better, and to generate precise and fluent interpretations. An additional experiment on cross-modal music retrieval shows that interpretations generated by BART-fusion can also help people retrieve music more accurately than with the original BART.",
    "zenodo_id": 7316584,
    "dblp_key": null
  },
  {
    "title": "Toward postprocessing-free neural networks for joint beat and downbeat estimation",
    "author": [
      "Tsung-Ping Chen",
      "Li Su"
    ],
    "year": "2022",
    "doi": "10.5281/zenodo.7342730",
    "url": "https://doi.org/10.5281/zenodo.7342730",
    "ee": "https://archives.ismir.net/ismir2022/paper/000002.pdf",
    "pages": "27-35",
    "abstract": "Recent deep learning-based models for estimating beats and downbeats are mainly composed of three successive stages---feature extraction, sequence modeling, and post processing. While such a framework is prevalent in the scenario of sequence labeling tasks and yields promising results in beat and downbeat estimations, it also indicates a shortage of the employed neural networks, given that the post-processing usually provides a notable performance gain over the previous stage. Moreover, the assumption often made for the post-processing is not suitable for many musical pieces. In this work, we attempt to improve the performance of joint beat and downbeat estimation without incorporating the post-processing stage. By inspecting a state-of-the-art approach, we propose reformulations regarding the network architecture and the loss function. We evaluate our model on various music data and show that the proposed methods are capable of improving the baseline approach without the aid of a post-processing stage.",
    "zenodo_id": 7342730,
    "dblp_key": null
  },
  {
    "title": "Music Translation: Generating Piano Arrangements in Different Playing Levels",
    "author": [
      "Matan Gover",
      "Oded Zewi"
    ],
    "year": "2022",
    "doi": "10.5281/zenodo.7316588",
    "url": "https://doi.org/10.5281/zenodo.7316588",
    "ee": "https://archives.ismir.net/ismir2022/paper/000003.pdf",
    "pages": "36-43",
    "abstract": "We present a novel task of playing level conversion: generating a music arrangement in a target difficulty level, given another arrangement of the same musical piece in a different level. For this task, we create a parallel dataset of piano arrangements in two strictly well-defined playing levels, annotated at individual phrase resolution, taken from the song catalog of a piano learning app.In a series of experiments, we train models that successfully modify the playing level while preserving the musical 'essence'. We further show, via an ablation study, the contributions of specific data representation and augmentation techniques to the model's performance.In order to evaluate the performance of our models, we conduct a human evaluation study with expert musicians. The evaluation shows that our best model creates arrangements that are almost as good as ground truth examples. Additionally, we propose MuTE, an automated evaluation metric for music translation tasks, and show that it correlates with human ratings.",
    "zenodo_id": 7316588,
    "dblp_key": null
  },
  {
    "title": "Scaling Polyphonic Transcription with Mixtures of Monophonic Transcriptions",
    "author": [
      "Ian Simon",
      "Joshua Gardner",
      "Curtis Hawthorne",
      "Ethan Manilow",
      "Jesse Engel"
    ],
    "year": "2022",
    "doi": "10.5281/zenodo.7316590",
    "url": "https://doi.org/10.5281/zenodo.7316590",
    "ee": "https://archives.ismir.net/ismir2022/paper/000004.pdf",
    "pages": "44-51",
    "abstract": "Automatic Music Transcription (AMT), in particular the problem of automatically extracting notes from audio, has seen much recent progress via the training of neural network models on musical audio recordings paired with aligned ground-truth note labels.  However, progress is currently limited by the difficulty of obtaining such note labels for natural audio recordings at scale.  In this paper, we take advantage of the fact that for monophonic music, the transcription problem is much easier and largely solved via modern pitch-tracking methods.  Specifically, we show that we are able to combine recordings of real monophonic music (and their transcriptions) into artificial and musically-incoherent mixtures, greatly increasing the scale of labeled training data.  By pretraining on these mixtures, we can use a larger neural network model and significantly improve upon the state of the art in multi-instrument polyphonic transcription.  We demonstrate this improvement across a variety of datasets and in a ``zero-shot'' setting where the model has not been trained on any data from the evaluation domain.",
    "zenodo_id": 7316590,
    "dblp_key": null
  },
  {
    "title": "Attention-based audio embeddings for query-by-example",
    "author": [
      "Anup Singh",
      "Kris Demuynck",
      "Vipul Arora"
    ],
    "year": "2022",
    "doi": "10.5281/zenodo.7316592",
    "url": "https://doi.org/10.5281/zenodo.7316592",
    "ee": "https://archives.ismir.net/ismir2022/paper/000005.pdf",
    "pages": "52-58",
    "abstract": "An ideal audio retrieval system efficiently and robustly recognizes a short query snippet from an extensive database. However, the performance of well-known audio fingerprinting systems falls short at high signal distortion levels. This paper presents an audio retrieval system that generates noise and reverberation robust audio fingerprints using the contrastive learning framework. Using these fingerprints, the method performs a comprehensive search to identify the query audio and precisely estimate its timestamp in the reference audio. Our framework involves training a CNN to maximize the similarity between pairs of embeddings extracted from clean audio and its corresponding distorted and time-shifted version. We employ a channel-wise spectral-temporal attention mechanism to capture salient time indices and spectral bands in the CNN features. The attention mechanism enables the CNN to better discriminate the audio by giving more weight to the salient spectral-temporal patches in the signal. Experimental results indicate that our system is efficient in computation and memory usage while being more accurate, particularly at higher distortion levels, than competing state-of-the-art systems and scalable to a larger database. ",
    "zenodo_id": 7316592,
    "dblp_key": null
  },
  {
    "title": "SIATEC-C: Computationally efficient repeated pattern discovery in polyphonic music",
    "author": [
      "Otso Björklund"
    ],
    "year": "2022",
    "doi": "10.5281/zenodo.7316594",
    "url": "https://doi.org/10.5281/zenodo.7316594",
    "ee": "https://archives.ismir.net/ismir2022/paper/000006.pdf",
    "pages": "59-66",
    "abstract": "The use of point-set representations of music enable repeated pattern discoveryto be performed on polyphonic music. The discovery of patterns containing polyphony is also enabled by the use of point-set representations. The SIA and SIATEC algorithms discover repeated patterns in point-sets bycomputing maximal translatable patterns and their translational equivalence classes.While the algorithms are relatively efficient, their application to larger piecesof music is not viable due to quadratic space complexity.This paper introcudes a novel algorithm, SIATEC-C, for repeated pattern discovery in point-set representations of music. The algorithm discovers repeated patterns and finds all of their occurrences, whilerunning with subquadratic space complexity. The algorithm can also provide significant runningtime improvements over the comparable SIATEC algorithm.The computational performance of the algorithm is compared with SIATEC. The accuracy of the algorithmis also evaluated on the JKU-PDD data set.",
    "zenodo_id": 7316594,
    "dblp_key": null
  },
  {
    "title": "Tailed U-Net: Multi-Scale Music Representation Learning",
    "author": [
      "Marcel A Vélez Vásquez",
      "John Ashley Burgoyne"
    ],
    "year": "2022",
    "doi": "10.5281/zenodo.7316596",
    "url": "https://doi.org/10.5281/zenodo.7316596",
    "ee": "https://archives.ismir.net/ismir2022/paper/000007.pdf",
    "pages": "67-75",
    "abstract": "Self-supervised learning has steadily been gaining traction in recent years. In music information retrieval (MIR), one promising recent application of self-supervised learning is the CLMR framework (contrastive learning of musical representations). CLMR has shown good performance, achieving results on par with state-of-the-art end-to-end classification models, but it is strictly an encoding framework. It suffers the characteristic limitation of any encoder that it cannot explicitly combine multi-timescale information, whereas a characteristic feature of human audio perception is that we tend to perceive all frequencies simultaneously. To this end, we propose a generalization of CLMR that learns to extract and explicitly combine representations across different frequency resolutions, which we coin the tailed U-Net (TUNe). TUNe architectures combine multi-timescale information during a decoding phase, similar to U-Net architectures used in computer vision and source separation, but have a tail added to reduce sample-level information to a smaller pre-defined number of representation dimensions. The size of the decoding phase is a hyperparameter, and in the case of a zero-layer decoding phase, TUNe reduces to CLMR. The best TUNe architectures, however, require less training time to match CLMR performance, have superior transfer learning performance, and are competitive with state-of-the-art models even at dramatically reduced dimensionalities.",
    "zenodo_id": 7316596,
    "dblp_key": null
  },
  {
    "title": "DDSP-based Singing Vocoders: A New Subtractive-based Synthesizer and A Comprehensive Evaluation",
    "author": [
      "Da-Yi Wu",
      "Wen-Yi Hsiao",
      "Fu-Rong Yang",
      "Oscar D Friedman",
      "Warren Jackson",
      "Scott Bruzenak",
      "Yi-Wen Liu",
      "Yi-Hsuan Yang"
    ],
    "year": "2022",
    "doi": "10.5281/zenodo.7316600",
    "url": "https://doi.org/10.5281/zenodo.7316600",
    "ee": "https://archives.ismir.net/ismir2022/paper/000008.pdf",
    "pages": "76-83",
    "abstract": "A vocoder is a conditional audio generation model that converts acoustic features such as mel-spectrograms into waveforms. Taking inspiration from Differentiable Digital Signal Processing (DDSP), we propose a new vocoder named SawSing for singing voices. SawSing synthesizes the harmonic part of singing voices by filtering a sawtooth source signal with a linear time-variant finite impulse response filter whose coefficients are estimated from the input mel-spectrogram by a neural network. As this approach enforces phase continuity, SawSing can generate singing voices without the phase-discontinuity glitch of many existing vocoders. Moreover, the source-filter assumption provides an inductive bias that allows SawSing to be trained on a small amount of data. Our evaluation shows that SawSing converges much faster and outperforms state-of-the-art generative adversarial network- and diffusion-based vocoders in a resource-limited scenario with only 3 training recordings and a 3-hour training time.",
    "zenodo_id": 7316600,
    "dblp_key": null
  },
  {
    "title": "Equivariant self-supervision for musical tempo estimation",
    "author": [
      "Elio Quinton"
    ],
    "year": "2022",
    "doi": "10.5281/zenodo.7316602",
    "url": "https://doi.org/10.5281/zenodo.7316602",
    "ee": "https://archives.ismir.net/ismir2022/paper/000009.pdf",
    "pages": "84-92",
    "abstract": "Self-supervised methods have emerged as a promising avenue for representation learning in the recent years since they alleviate the need for labeled datasets, which are scarce and expensive to acquire. Contrastive methods are a popular choice for self-supervision in the audio domain, and typically provide a learning signal by forcing the model to be invariant to some transformations of the input. These methods, however, require measures such as negative sampling or some form of regularisation to be taken to prevent the model from collapsing on trivial solutions. In this work, instead of invariance, we propose to use equivariance as a self-supervision signal to learn audio tempo representations from unlabelled data. We derive a simple loss function that prevents the network from collapsing on a trivial solution during training, without requiring any form of regularisation or negative sampling.Our experiments show that it is possible to learn meaningful representations for tempo estimation by solely relying on equivariant self-supervision, achieving performance comparable with supervised methods on several benchmarks. As an added benefit, our method only requires moderate compute resources and therefore remains accessible to a wide research community.",
    "zenodo_id": 7316602,
    "dblp_key": null
  },
  {
    "title": "How Music features and Musical Data Representations Affect Objective Evaluation of Music Composition: A Review of CSMT Data Challenge 2020",
    "author": [
      "Yuqiang Li",
      "Shengchen Li",
      "George Fazekas"
    ],
    "year": "2022",
    "doi": "10.5281/zenodo.7316604",
    "url": "https://doi.org/10.5281/zenodo.7316604",
    "ee": "https://archives.ismir.net/ismir2022/paper/000010.pdf",
    "pages": "93-99",
    "abstract": "Tools and methodologies for distinguishing computer-generated melodies from human-composed melodies have a broad range of applications from detecting copyright infringement through the evaluation of generative music systems to facilitating transparent and explainable AI. This paper reviews a data challenge on distinguishing computer-generated melodies from human-composed melodies held in association with the Conference on Sound and Music Technology (CSMT) in 2020. An investigation of the submitted systems and the results are presented first. Besides the structure of the proposed models, the paper investigates two important factors that were identified as contributors to good model performance: the specific music features and the music representation used. Through an analysis of the submissions, important melody-related music features have been identified. Encoding or representation of the music in the context of neural network modes has also been found to significantly impact system performance through an experiment where the top-ranked system was re-implemented with different input representations for comparison purposes. Besides demonstrating the feasibility of developing an objective music composition evaluation system, the investigation presented in this paper also reveals some important limitations of current music composition systems opening opportunities for future work in the community.",
    "zenodo_id": 7316604,
    "dblp_key": null
  },
  {
    "title": "YM2413-MDB: A Multi-Instrumental FM Video Game Music Dataset with Emotion Annotations",
    "author": [
      "Eunjin Choi",
      "Yoonjin Chung",
      "Seolhee Lee",
      "Jongik Jeon",
      "Taegyun Kwon",
      "Juhan Nam"
    ],
    "year": "2022",
    "doi": "10.5281/zenodo.7316606",
    "url": "https://doi.org/10.5281/zenodo.7316606",
    "ee": "https://archives.ismir.net/ismir2022/paper/000011.pdf",
    "pages": "100-108",
    "abstract": "Existing multi-instrumental datasets tend to be biased toward pop and classical music. In addition, they generally lack high-level annotations such as emotion tags. In this paper, we propose YM2413-MDB, an 80s FM video game music dataset with multi-label emotion annotations. It includes 669 audio and MIDI files of music from Sega and MSX PC games in the 80s using YM2413, a programmable sound generator based on FM. The collected game music is arranged with a subset of 15 monophonic instruments and one drum instrument. They were converted from binary commands of the YM2413 sound chip. Each song was labeled with 19 emotion tags by two annotators and validated by three verifiers to obtain refined tags. We provide the baseline models and results for emotion recognition and emotion-conditioned symbolic music generation using YM2413-MDB.",
    "zenodo_id": 7316606,
    "dblp_key": null
  },
  {
    "title": "Detecting Symmetries of All Cardinalities With Application to Musical 12-Tone Rows",
    "author": [
      "Anil Venkatesh",
      "Viren Sachdev"
    ],
    "year": "2022",
    "doi": "10.5281/zenodo.7316608",
    "url": "https://doi.org/10.5281/zenodo.7316608",
    "ee": "https://archives.ismir.net/ismir2022/paper/000012.pdf",
    "pages": "109-115",
    "abstract": "Popularized by Arnold Schoenberg in the mid-20th century, the method of twelve-tone composition produces musical compositions based on one or more orderings of the equal-tempered chromatic scale. The work of twelve-tone composers is famously challenging to traditional Western tonal and structural sensibilities; even so, group theoretic approaches have determined that 10% of certain composers’ works contain a highly unusual classical symmetry of music. We extend this result by revealing many symmetries that were previously undetected in the works of Schoenberg, Webern, and Berg. Our approach is computational rather than group theoretic, scanning each composition for symmetries of many different cardinalities. Thus, we capture partial symmetries that would be overlooked by more formal means. Moreover, our methods are applicable beyond the narrow scope of twelve-tone composition. We achieve our results by first extending the group-theoretic notion of symmetry to encompass shorter motives that may be repeated and reprised in a given composition, and then comparing the incidence of these symmetries between the work of composers and the space of all possible 12-tone rows. We present four candidate hierarchies of symmetry and show that in each model, between 75% and 95% of actual compositions contained high levels of internal symmetry.",
    "zenodo_id": 7316608,
    "dblp_key": null
  },
  {
    "title": "The power of deep without going deep? A study of HDPGMM music representation learning",
    "author": [
      "Jaehun Kim",
      "Cynthia C. S. Liem"
    ],
    "year": "2022",
    "doi": "10.5281/zenodo.7316610",
    "url": "https://doi.org/10.5281/zenodo.7316610",
    "ee": "https://archives.ismir.net/ismir2022/paper/000013.pdf",
    "pages": "116-124",
    "abstract": "In the previous decade, Deep Learning (DL) has proven to be one of the most effective machine learning methods to tackle a wide range of Music Information Retrieval (MIR) tasks. It offers highly expressive learning capacity that can fit any music representation needed for MIR-relevant downstream tasks. However, it has been criticized for sacrificing interpretability. On the other hand, the Bayesian nonparametric (BN) approach promises similar positive properties as DL, such as high flexibility, while being robust to overfitting and preserving interpretability. Therefore, the primary motivation of this work is to explore the potential of Bayesian nonparametric models in comparison to DL models for music representation learning. More specifically, we assess the music representation learned from the Hierarchical Dirichlet Process Gaussian Mixture Model (HDPGMM), an infinite mixture model based on the Bayesian nonparametric approach, to MIR tasks, including classification, auto-tagging, and recommendation. The experimental result suggests that the HDPGMM music representation can outperform DL representations in certain scenarios, and overall comparable.",
    "zenodo_id": 7316610,
    "dblp_key": null
  },
  {
    "title": "Pop Music Generation with Controllable Phrase Lengths",
    "author": [
      "Daiki Naruse",
      "Tomoyuki Takahata",
      "Yusuke Mukuta",
      "Tatsuya Harada"
    ],
    "year": "2022",
    "doi": "10.5281/zenodo.7316612",
    "url": "https://doi.org/10.5281/zenodo.7316612",
    "ee": "https://archives.ismir.net/ismir2022/paper/000014.pdf",
    "pages": "125-131",
    "abstract": "Research on music generation using deep learning has attracted more attention; in particular, Transformer-based models have succeeded in generating coherent musical pieces. Recently, an increasing number of studies have focused on phrases that are smaller musical units, and several studies have addressed phrase-level control. In this study, we propose a method for sequentially generating a piece that enables the control of each phrase length and, consequently, the length of the entire piece. We added PHRASE and a new event, BAR COUNTDOWN, which indicates the number of bars remaining in the phrase, to the existing event-based music representations. To reflect user input indicating the phrase lengths of the piece being generated, we used an autoregressive generation model that adds these two events to the generated event-token sequence based on the user input and uses it as input for the next time step. Subjective listening tests revealed that the pieces generated by our methods possessed designated phrase lengths and ended naturally at the determined length.",
    "zenodo_id": 7316612,
    "dblp_key": null
  },
  {
    "title": "Exploiting Pre-trained Feature Networks for Generative Adversarial Networks in Audio-domain Loop Generation",
    "author": [
      "Yen-Tung Yeh",
      "Yi-Hsuan Yang",
      "Bo-Yu Chen"
    ],
    "year": "2022",
    "doi": "10.5281/zenodo.7316614",
    "url": "https://doi.org/10.5281/zenodo.7316614",
    "ee": "https://archives.ismir.net/ismir2022/paper/000015.pdf",
    "pages": "132-140",
    "abstract": "While generative adversarial networks (GANs) have been widely used in research on audio generation, the training of a GAN model is known to be unstable, time consuming, and data inefficient. Among the attempts to ameliorate the training process of GANs, the idea of Projected GAN emerges as an effective solution for GAN-based image generation, establishing the state-of-the-art in different image applications. The core idea is to use a pre-trained classifier to constrain the feature space of the discriminator to stabilize and improve GAN training. This paper investigates whether Projected GAN can similarly improve audio generation, by evaluating the performance of a StyleGAN2-based audio-domain loop generation model with and without using a pre-trained feature space in the discriminator. Moreover, we compare the performance of using a general versus domain-specific classifier as the pre-trained audio classifier. With experiments on both drum loop and synth loop generation, we show that a general audio classifier works better, and that with Projected GAN our loop generation models can converge around 5 times faster without performance degradation.",
    "zenodo_id": 7316614,
    "dblp_key": null
  },
  {
    "title": "Modeling the rhythm from lyrics for melody generation of pop songs",
    "author": [
      "Daiyu Zhang",
      "Ju-Chiang Wang",
      "Katerina Kosta",
      "Jordan B. L. Smith",
      "Shicen Zhou"
    ],
    "year": "2022",
    "doi": "10.5281/zenodo.7316616",
    "url": "https://doi.org/10.5281/zenodo.7316616",
    "ee": "https://archives.ismir.net/ismir2022/paper/000016.pdf",
    "pages": "141-148",
    "abstract": "Creating a pop song melody according to pre-written lyrics is a typical practice for composers. A computational model of how lyrics are set as melodies is important for automatic composition systems, but an end-to-end lyric-to-melody model would require enormous amounts of paired training data. To mitigate the data constraints, we adopt a two-stage approach, dividing the task into lyric-to-rhythm and rhythm-to-melody modules. However, the lyric-to-rhythm task is still challenging due to its multimodality. In this paper, we propose a novel lyric-to-rhythm framework that includes part-of-speech tags to achieve better text-setting, and a Transformer architecture designed to model long-term syllable-to-note associations. For the rhythm-to-melody task, we adapt a proven chord-conditioned melody Transformer, which has achieved state-of-the-art results. Experiments for Chinese lyric-to-melody generation show that the proposed framework is able to model key characteristics of rhythm and pitch distributions in the dataset, and in a subjective evaluation, the melodies generated by our system were rated as similar to or better than those of a state-of-the-art alternative.",
    "zenodo_id": 7316616,
    "dblp_key": null
  },
  {
    "title": "Visualization for AI-Assisted Composing",
    "author": [
      "Simeon Rau",
      "Frank Heyen",
      "Stefan Wagner",
      "Michael Sedlmair"
    ],
    "year": "2022",
    "doi": "10.5281/zenodo.7316618",
    "url": "https://doi.org/10.5281/zenodo.7316618",
    "ee": "https://archives.ismir.net/ismir2022/paper/000017.pdf",
    "pages": "151-159",
    "abstract": "We propose a visual approach for interactive, AI-assisted composition that serves as a compromise between fully automatic and fully manual composition. Instead of generating a whole piece, the AI takes on the role of an assistant that generates short melodies for the composer to choose from and adapt. In an iterative process, the composer queries the AI for continuations or alternative fill-ins, chooses a suggestion, and adds it to the piece. As listening to many suggestions would take time, we explore different ways to visualize them, to allow the composer to focus on the most interesting-looking melodies. We also present the results of a qualitative evaluation with five composers.",
    "zenodo_id": 7316618,
    "dblp_key": null
  },
  {
    "title": "Retrieving musical information from neural data: how cognitive features enrich acoustic ones",
    "author": [
      "Ellie Bean Abrams",
      "Eva Muñoz Vidal",
      "Claire Pelofi",
      "Pablo Ripollés"
    ],
    "year": "2022",
    "doi": "10.5281/zenodo.7343078",
    "url": "https://doi.org/10.5281/zenodo.7343078",
    "ee": "https://archives.ismir.net/ismir2022/paper/000018.pdf",
    "pages": "160-168",
    "abstract": "Various features – from low-level acoustics, to higher-level statistical regularities, to memory associations – contribute to the experience of musical enjoyment and pleasure. Recent work suggests that musical surprisal, that is, the unexpectedness of a musical event given its context, may directly predict listeners’ experiences of pleasure and enjoyment during music listening. Understanding how surprisal shapes listeners’ preferences for certain musical pieces has implications for music recommender systems, which are typically content- (both acoustic or semantic) or metadata-based. Here we test a recently developed computational algorithm, called Dynamic-Regularity Extraction (D-REX), that uses Bayesian inference to predict the surprisal that humans experience while listening to music. We demonstrate that the brain tracks musical surprisal as modeled by D-REX by conducting a decoding analysis on the neural signal (collected through magnetoencephalography) of participants listening to music. Thus, we demonstrate the validity of a computational model of musical surprisal, which may remarkably inform the next generation of recommender systems. In addition, we present an open-source neural dataset which will be available for future research to foster approaches combining MIR with cognitive neuroscience, an approach we believe will be a key strategy in characterizing people’s reactions to music.  ",
    "zenodo_id": 7343078,
    "dblp_key": null
  },
  {
    "title": "Beat Transformer: Demixed Beat and Downbeat Tracking with Dilated Self-Attention",
    "author": [
      "Jingwei Zhao",
      "Gus Xia",
      "Ye Wang"
    ],
    "year": "2022",
    "doi": "10.5281/zenodo.7316622",
    "url": "https://doi.org/10.5281/zenodo.7316622",
    "ee": "https://archives.ismir.net/ismir2022/paper/000019.pdf",
    "pages": "169-177",
    "abstract": "We propose Beat Transformer, a novel Transformer encoder architecture for joint beat and downbeat tracking. Different from previous models that track beats solely based on the spectrogram of an audio mixture, our model deals with demixed spectrograms with multiple instrument channels. This is inspired by the fact that humans perceive metrical structures from richer musical contexts, such as chord progression and instrumentation. To this end, we develop a Transformer model with both time-wise attention and instrument-wise attention to capture deep-buried metrical cues. Moreover, our model adopts a novel dilated self-attention mechanism, which achieves powerful hierarchical modelling with only linear complexity. Experiments demonstrate a significant improvement in demixed beat tracking over the non-demixed version. Also, Beat Transformer achieves up to 4% point improvement in downbeat tracking accuracy over the TCN architectures. We further discover an interpretable attention pattern that mirrors our understanding of hierarchical metrical structures.",
    "zenodo_id": 7316622,
    "dblp_key": null
  },
  {
    "title": "Sketching the Expression: Flexible Rendering of Expressive Piano Performance with Self-Supervised Learning",
    "author": [
      "Seungyeon Rhyu",
      "Sarah Kim",
      "Kyogu Lee"
    ],
    "year": "2022",
    "doi": "10.5281/zenodo.7342916",
    "url": "https://doi.org/10.5281/zenodo.7342916",
    "ee": "https://archives.ismir.net/ismir2022/paper/000020.pdf",
    "pages": "178-185",
    "abstract": "We propose a system for rendering a symbolic piano performance with flexible musical expression. It is necessary to actively control musical expression for creating a new music performance that conveys various emotions or nuances. However, previous approaches were limited to following the composer's guidelines of musical expression or dealing with only a part of the musical attributes. We aim to disentangle the entire musical expression and structural attribute of piano performance using a conditional VAE framework. It stochastically generates expressive parameters from latent representations and given note structures. In addition, we employ self-supervised approaches that force the latent variables to represent target attributes. Finally, we leverage a two-step encoder and decoder that learn hierarchical dependency to enhance the naturalness of the output. Experimental results show that our system can stably generate performance parameters relevant to the given musical scores, learn disentangled representations, and control musical attributes independently of each other.",
    "zenodo_id": 7342916,
    "dblp_key": null
  },
  {
    "title": "Exploiting Device and Audio Data to Tag Music with User-Aware Listening Contexts",
    "author": [
      "Karim M. Ibrahim",
      "Elena V. Epure",
      "Geoffroy Peeters",
      "Gaël Richard"
    ],
    "year": "2022",
    "doi": "10.5281/zenodo.7342816",
    "url": "https://doi.org/10.5281/zenodo.7342816",
    "ee": "https://archives.ismir.net/ismir2022/paper/000021.pdf",
    "pages": "186-192",
    "abstract": "As music has become more available especially on music streaming platforms, people have started to have distinct preferences to fit to their varying listening situations, also known as context. Hence, there has been a growing interest in considering the user's situation when recommending music to users. Previous works have proposed personalized auto-taggers to infer situation-related tags from music content and user's global listening preferences. However, in a practical music retrieval system, these context-aware auto-tagger could be only used by assuming that the context class is explicitly provided by the user. In this work, for designing a fully automatised music retrieval system, we propose to disambiguate the user's listening information from stream data. Namely, we propose a system which can generate a situational playlist for a user at a certain time first by leveraging personalized music auto-taggers, and second by automatically inferring the user's situation from stream data (e.g. device, network) and user's general profile information (e.g. age). Experiments show that such a personalized context-aware music retrieval system is feasible, but the performance suffers in the case of new users, new tracks or when the number of context classes increases. ",
    "zenodo_id": 7342816,
    "dblp_key": null
  },
  {
    "title": "Jukedrummer: Conditional Beat-aware Audio-domain Drum Accompaniment Generation via Transformer VQ-VAE",
    "author": [
      "Yueh-Kao Wu",
      "Ching-Yu Chiu",
      "Yi-Hsuan Yang"
    ],
    "year": "2022",
    "doi": "10.5281/zenodo.7316628",
    "url": "https://doi.org/10.5281/zenodo.7316628",
    "ee": "https://archives.ismir.net/ismir2022/paper/000022.pdf",
    "pages": "193-200",
    "abstract": "This paper proposes a model that generates a drum track in the audio domain to play along to a user-provided drum-free recording. Specifically, using paired data of drumless tracks and the corresponding human-made drum tracks, we train a Transformer model to improvise the drum part of an unseen drumless recording. We combine two approaches to encode the input audio. First, we train a vector-quantized variational autoencoder (VQ-VAE) to represent the input audio with discrete codes, which can then be readily used in a Transformer. Second, using an audio- domain beat tracking model, we compute beat-related features of the input audio and use them as embeddings in the Transformer. Instead of generating the drum track directly as waveforms, we use a separate VQ-VAE to encode the mel-spectrogram of a drum track into another set of discrete codes, and train the Transformer to predict the sequence of drum-related discrete codes. The output codes are then converted to a mel-spectrogram with a decoder, and then to the waveform with a vocoder. We report both objective and subjective evaluations of variants of the proposed model, demonstrating that the model with beat information generates drum accompaniment that is rhythmically and stylistically consistent with the input audio.",
    "zenodo_id": 7316628,
    "dblp_key": null
  },
  {
    "title": "Learning Hierarchical Metrical Structure Beyond Measures",
    "author": [
      "Junyan Jiang",
      "Daniel Chin",
      "Yixiao Zhang",
      "Gus Xia"
    ],
    "year": "2022",
    "doi": "10.5281/zenodo.7316630",
    "url": "https://doi.org/10.5281/zenodo.7316630",
    "ee": "https://archives.ismir.net/ismir2022/paper/000023.pdf",
    "pages": "201-209",
    "abstract": "Music contains hierarchical structures beyond beats and measures. While hierarchical structure annotations are helpful for music information retrieval and computer musicology, such annotations are scarce in current digital music databases. In this paper, we explore a data-driven approach to automatically extract hierarchical metrical structures from scores. We propose a new model with a Temporal Convolutional Network-Conditional Random Field (TCN-CRF) architecture. Given a symbolic music score, our model takes in an arbitrary number of voices in a beat-quantized form, and predicts a 4-level hierarchical metrical structure from downbeat-level to section-level. We also annotate a dataset using RWC-POP MIDI files to facilitate training and evaluation. We show by experiments that the proposed method performs better than the rule-based approach under different orchestration settings. We also perform some simple musicological analysis on the model predictions. All demos, datasets and pre-trained models are publicly available on Github.",
    "zenodo_id": 7316630,
    "dblp_key": null
  },
  {
    "title": "Mid-level Harmonic Audio Features for Musical Style Classification",
    "author": [
      "Francisco C. F. Almeida",
      "Gilberto Bernardes",
      "Christof Weiss"
    ],
    "year": "2022",
    "doi": "10.5281/zenodo.7316632",
    "url": "https://doi.org/10.5281/zenodo.7316632",
    "ee": "https://archives.ismir.net/ismir2022/paper/000024.pdf",
    "pages": "210-217",
    "abstract": "The extraction of harmonic information from musical audio is fundamental for several music information retrieval tasks. In this paper, we propose novel harmonic audio features based on the perceptually-inspired tonal interval vector space, computed as the Fourier transform of chroma vectors. Our contribution includes mid-level features for musical dissonance, chromaticity, dyadicity, triadicity, diminished quality, diatonicity, and whole-toneness. Moreover, we quantify the perceptual relationship between short- and long-term harmonic structures, tonal dispersion, harmonic changes, and complexity. Beyond the computation on fixed-size windows, we propose a context-sensitive harmonic segmentation approach. We assess the robustness of the new harmonic features in style classification tasks regarding classical music periods and composers. Our results align with, slightly outperforming, existing features and suggest that other musical properties than those in state-of-the-art literature are partially captured. We discuss the features regarding their musical interpretation and compare the different feature groups regarding their effectiveness for discriminating classical music periods and composers.",
    "zenodo_id": 7316632,
    "dblp_key": null
  },
  {
    "title": "Distortion Audio Effects: Learning How to Recover the Clean Signal",
    "author": [
      "Johannes Imort",
      "Giorgio Fabbro",
      "Marco A Martinez Ramirez",
      "Stefan Uhlich",
      "Yuichiro Koyama",
      "Yuki Mitsufuji"
    ],
    "year": "2022",
    "doi": "10.5281/zenodo.7316634",
    "url": "https://doi.org/10.5281/zenodo.7316634",
    "ee": "https://archives.ismir.net/ismir2022/paper/000025.pdf",
    "pages": "218-225",
    "abstract": "Given the recent advances in music source separation and automatic mixing, removing audio effects in music tracks is a meaningful step toward developing an automated remixing system. This paper focuses on removing distortion audio effects applied to guitar tracks in music production. We explore whether effect removal can be solved by neural networks designed for source separation and audio effect modeling.Our approach proves particularly effective for effects that mix the processed and clean signals. The models achieve better quality and significantly faster inference compared to state-of-the-art solutions based on sparse optimization. We demonstrate that the models are suitable not only for declipping but also for other types of distortion effects. By discussing the results, we stress the usefulness of multiple evaluation metrics to assess different aspects of reconstruction in distortion effect removal.",
    "zenodo_id": 7316634,
    "dblp_key": null
  },
  {
    "title": "End-to-End Full-Page Optical Music Recognition for Mensural Notation",
    "author": [
      "Antonio Ríos-Vila",
      "Jose M. Inesta",
      "Jorge Calvo-Zaragoza"
    ],
    "year": "2022",
    "doi": "10.5281/zenodo.7342678",
    "url": "https://doi.org/10.5281/zenodo.7342678",
    "ee": "https://archives.ismir.net/ismir2022/paper/000026.pdf",
    "pages": "226-232",
    "abstract": "Optical Music Recognition (OMR) systems typically consider workflows that include several steps, such as staff detection, symbol recognition, and semantic reconstruction. However, fine-tuning these systems is costly due to the specific data labeling process that has to be performed to train models for each of these steps. In this paper, we present the first segmentation-free full-page OMR system that receives a page image and directly outputs the transcription in a single step. This model requires only the annotations of full score pages, which greatly alleviates the task of manual labeling. The model has been tested with early music written in mensural notation, for which the presented approach is especially beneficial. Results show that this methodology provides a solution with promising results and establishes a new line of research for holistic transcription of music score pages.",
    "zenodo_id": 7342678,
    "dblp_key": null
  },
  {
    "title": "Mel Spectrogram Inversion with Stable Pitch",
    "author": [
      "Bruno Di Giorgi",
      "Mark Levy",
      "Richard Sharp"
    ],
    "year": "2022",
    "doi": "10.5281/zenodo.7316638",
    "url": "https://doi.org/10.5281/zenodo.7316638",
    "ee": "https://archives.ismir.net/ismir2022/paper/000027.pdf",
    "pages": "233-239",
    "abstract": "Vocoders are models capable of transforming a low-dimensional spectral representation of an audio signal, typically the mel spectrogram, to a waveform. Modern speech generation pipelines use a vocoder as their final component. Recent vocoder models developed for speech achieve high degree of realism, such that it is natural to wonder how they would perform on music signals. Compared to speech, the heterogeneity and structure of the musical sound texture offers new challenges. In this work we focus on one specific artifact that some vocoder models designed for speech tend to exhibit when applied to music: the perceived instability of pitch when synthesizing sustained notes. We argue that the characteristic sound of this artifact is due to the lack of horizontal phase coherence, which is often the result of using a time-domain target space with a model that is invariant to time-shifts, such as a convolutional neural network. We propose a new vocoder model that is specifically designed for music. Key to improving the pitch stability is the choice of a shift-invariant target space that consists of the magnitude spectrum and the phase gradient. We discuss the reasons that inspired us to re-formulate the vocoder task, outline a working example, and evaluate it on musical signals. Our method results in 60% and 10% improved reconstruction of sustained notes and chords with respect to existing models, using a novel harmonic error metric.",
    "zenodo_id": 7316638,
    "dblp_key": null
  },
  {
    "title": "Latent feature augmentation for chorus detection",
    "author": [
      "Xingjian Du",
      "Huidong Liang",
      "Yuan Wan",
      "Yuheng Lin",
      "Ke Chen",
      "Bilei Zhu",
      "Zejun Ma"
    ],
    "year": "2022",
    "doi": "10.5281/zenodo.7316640",
    "url": "https://doi.org/10.5281/zenodo.7316640",
    "ee": "https://archives.ismir.net/ismir2022/paper/000028.pdf",
    "pages": "240-247",
    "abstract": "In this paper, we introduce LA-Chorus, a chorus detection model based on latent feature augmentation and ResNet FPN architecture. Our contributions in LA-Chorus are three-fold. Firstly, we propose a method for implicitly augmenting chorus data in the latent space during the train7 ing stage. Compared to augmentations on audio surfaces such as time stretching and pitch shifting, latent augmentations indicate changes at a higher level in original audio, thereby increasing the diversity and sufficiency in training. Second, we apply Feature Pyramid Network (FPN) to generate additional embeddings from low dimension to high dimension, consequently achieving a multi-scale training paradigm. Lastly, we release Di-Chorus, a new open-source dataset of diverse genres and languages for the community of music structure analysis. In conjunction with other public datasets, we conduct comprehensive ex18 periments to evaluate the performance of LA-Chorus compared to other state-of-the-art models, which demonstrate the out-performance of LA-Chorus and the effectiveness of proposed latent feature augmentation.",
    "zenodo_id": 7316640,
    "dblp_key": null
  },
  {
    "title": "AccoMontage2: A Complete Harmonization and Accompaniment Arrangement System",
    "author": [
      "Li Yi",
      "Haochen Hu",
      "Jingwei Zhao",
      "Gus Xia"
    ],
    "year": "2022",
    "doi": "10.5281/zenodo.7316642",
    "url": "https://doi.org/10.5281/zenodo.7316642",
    "ee": "https://archives.ismir.net/ismir2022/paper/000029.pdf",
    "pages": "248-255",
    "abstract": "We propose AccoMontage2, a system capable of doing full-length song harmonization and accompaniment arrangement based on a lead melody. Following AccoMontage, this study focuses on generating piano arrangements for popular/folk songs and it carries on the generalized template-based retrieval method. The novelties of this study are twofold. First, we invent a harmonization module (which AccoMontage does not have). This module generates structured and coherent full-length chord progression by optimizing and balancing three loss terms: a micro-level loss for note-wise dissonance, a meso-level loss for phrase-template matching, and a macro-level loss for full piece coherency. Second, we develop a graphical user interface which allows users to select different styles of chord progression and piano texture. Currently, chord progression styles include Pop, R&B, and Dark, while piano texture styles include several levels of voicing density and rhythmic complexity. Experimental results show that both our harmonization and arrangement results significantly outperform the baselines. Lastly, we release AccoMontage2 as an online application as well as the organized chord progression templates as a public dataset. ",
    "zenodo_id": 7316642,
    "dblp_key": null
  },
  {
    "title": "Supervised and Unsupervised Learning of Audio Representations for Music Understanding",
    "author": [
      "Matthew C Mccallum",
      "Filip Korzeniowski",
      "Sergio Oramas",
      "Fabien Gouyon",
      "Andreas Ehmann"
    ],
    "year": "2022",
    "doi": "10.5281/zenodo.7316644",
    "url": "https://doi.org/10.5281/zenodo.7316644",
    "ee": "https://archives.ismir.net/ismir2022/paper/000030.pdf",
    "pages": "256-263",
    "abstract": "In this work, we provide a broad comparative analysis of strategies for pre-training audio understanding models for several tasks in the music domain, including labelling of genre, era, origin, mood, instrumentation, key, pitch, vocal characteristics, tempo and sonority. Specifically, we explore how the domain of pre-training datasets (music or generic audio) and the pre-training methodology (supervised or unsupervised) affects the adequacy of the resulting audio embeddings for downstream tasks.We show that models trained via supervised learning on large-scale expert-annotated music datasets achieve state-of-the-art performance in a wide range of music labelling tasks, each with novel content and vocabularies. This can be done in an efficient manner with models containing less than 100 million parameters that require no fine-tuning or reparameterization for downstream tasks, making this approach practical for industry-scale audio catalogs.Within the class of unsupervised learning strategies, we show that the domain of the training dataset can significantly impact the performance of representations learned by the model. We find that restricting the domain of the pre-training dataset to music allows for training with smaller batch sizes while achieving state-of-the-art in unsupervised learning---and in some cases, supervised learning---for music understanding.We also corroborate that, while achieving state-of-the-art performance on many tasks, supervised learning can cause models to specialize to the supervised information provided, somewhat compromising a model's generality.",
    "zenodo_id": 7316644,
    "dblp_key": null
  },
  {
    "title": "Generating Coherent Drum Accompaniment with Fills and Improvisations",
    "author": [
      "Rishabh A Dahale",
      "Vaibhav Vinayak Talwadker",
      "Preeti Rao",
      "Prateek Verma"
    ],
    "year": "2022",
    "doi": "10.5281/zenodo.7316646",
    "url": "https://doi.org/10.5281/zenodo.7316646",
    "ee": "https://archives.ismir.net/ismir2022/paper/000031.pdf",
    "pages": "264-271",
    "abstract": "Creating a complex work of art like music necessitates profound creativity. With recent advancements in Deep Learning and powerful models such as Transformers, there has been huge progress in automatic music generation. In an accompaniment generation context, creating a coherent drum pattern with apposite fills and improvisations at proper locations in a song is a challenging task even for an experienced drummer. Drum beats tend to follow a repetitive pattern through stanzas with fills/improvisation at section boundaries. In this work, we tackle the task of drum pattern generation conditioned on the accompanying music played by four melodic instruments – Piano, Guitar, Bass and Strings. We use the transformer sequence to sequence model to generate a basic drum pattern conditioned on the melodic accompaniment to find that improvisation is largely absent, attributed possibly to its relatively low representation in the training data. We propose a novelty function that represents the extent of improvisation in a specific bar relative to its neighbors. We train a model to detect improvisation positions from the melodic accompaniment tracks. Finally, we use a novel BERT inspired in-filling architecture, to learn the structure of both the drums and melody to in-fill elements of improvised music.",
    "zenodo_id": 7316646,
    "dblp_key": null
  },
  {
    "title": "Bottlenecks and solutions for audio to score alignment research",
    "author": [
      "Alia Morsi",
      "Xavier Serra"
    ],
    "year": "2022",
    "doi": "10.5281/zenodo.7343047",
    "url": "https://doi.org/10.5281/zenodo.7343047",
    "ee": "https://archives.ismir.net/ismir2022/paper/000032.pdf",
    "pages": "272-279",
    "abstract": "Although audio to score alignment is a classic Music Information Retrieval problem, it has not been defined uniquely with the scope of musical scenarios representing its core. The absence of a unified vision makes it difficult to pinpoint its state-of-the-art and determine directions for improvement. To get past this bottleneck, it is necessary to consolidate datasets and evaluation methodologies to allow comprehensive benchmarking. In our review of prior work, we demonstrate the extent of variation in problem scope, datasets, and evaluation practices across audio to score alignment research. To circumvent the high cost of creating large-scale datasets with various instruments, styles, performance conditions, and musician proficiency from scratch, the research community could generate ground truth approximations from non-audio to score alignment datasets which include a temporal mapping between a music score and its corresponding audio. We show a methodology for adapting the Aligned Scores and Performances dataset, created originally for beat tracking and music transcription. We filter the dataset semi- automatically by applying a set of Dynamic Time Warping based Audio to Score Alignment methods using out-of-the-box Chroma and Constant-Q Transform extraction algorithms, suitable for the characteristics of the piano performances of the dataset. We use the results to discuss the limitations of the generated ground truths and data adaptation method. While the adapted dataset does not provide the necessary diversity for solving the initial problem, we conclude with ideas for expansion, and identify future directions for curating more comprehensive datasets through data adaptation, or synthesis.",
    "zenodo_id": 7343047,
    "dblp_key": null
  },
  {
    "title": "Raga Classification From Vocal Performances Using Multimodal Analysis  ",
    "author": [
      "Martin Clayton",
      "Preeti Rao",
      "Nithya Shikarpur",
      "Sujoy Roychowdhury",
      "Jin Li"
    ],
    "year": "2022",
    "doi": "10.5281/zenodo.7316650",
    "url": "https://doi.org/10.5281/zenodo.7316650",
    "ee": "https://archives.ismir.net/ismir2022/paper/000033.pdf",
    "pages": "283-290",
    "abstract": "Work on musical gesture and embodied cognition suggests a rich complementarity between audio and movement information in musical performance. Pose estimation algorithms now make it possible (in contrast to Motion Capture)  to collect rich movement information from unconstrained performances of indefinite length. Vocal performances of Indian art music  offer the opportunity to carry out multimodal analysis using this information, combing musician’s body movements (i.e. pose and gesture data) with audio features. In this work we investigate raga identification from 12 s excerpts from a dataset of 3 singers and 9 ragas using the combination of audio and visual representations that are each semantically salient on their own.  While gesture based classification is relatively weak by itself, we show that combining latent representations from the pre-trained unimodal networks can surpass the already high performance obtained by audio features. ",
    "zenodo_id": 7316650,
    "dblp_key": null
  },
  {
    "title": "Traces of Globalization in Online Music Consumption Patterns and Results of Recommendation Algorithms",
    "author": [
      "Oleg Lesota",
      "Emilia Parada-Cabaleiro",
      "Stefan Brandl",
      "Elisabeth Lex",
      "Navid Rekabsaz",
      "Markus Schedl"
    ],
    "year": "2022",
    "doi": "10.5281/zenodo.7316652",
    "url": "https://doi.org/10.5281/zenodo.7316652",
    "ee": "https://archives.ismir.net/ismir2022/paper/000034.pdf",
    "pages": "291-297",
    "abstract": "Music streaming platforms allow users to enjoy music from all over the globe.Such opportunity speeds up cultural exchange between different countries, a process often associated with globalization. While such an exchange could lead to more diverse music consumption, empirical evidence on its influence on online music consumption is limited. Besides, the extent to which music recommender systems foster exchange or amplify globalization in music remains an understudied problem.In this paper, we present findings from an empirical study to detect traces of globalization in domestic vs. foreign online music consumption. Besides, we investigate if popular recommendation algorithms, specifically ItemKNN and NeuMF, are prone to amplifying globalization processes. Our experiments on Last.fm listening data show nuanced patterns of globalization in music consumption. We observe a strong position of US music in all considered countries. In countries such as Sweden, Great Britain, or Brazil, US music shows various levels of coexistence with domestic music. We find that Finland is least influenced by US music, while greatly consuming and 'exporting' domestic music.  With respect to recommendation algorithms, ItemKNN tends to recommend domestic music to users of many countries, while NeuMF contributes to accelerating globalization and shifting balance towards dominance of US music on the market.",
    "zenodo_id": 7316652,
    "dblp_key": null
  },
  {
    "title": "Network Analyses for Cross-Cultural Music Popularity",
    "author": [
      "Kongmeng Liew",
      "Vipul Mishra",
      "Yangyang Zhou",
      "Elena V. Epure",
      "Romain Hennequin",
      "Shoko Wakamiya",
      "Eiji Aramaki"
    ],
    "year": "2022",
    "doi": "10.5281/zenodo.7316654",
    "url": "https://doi.org/10.5281/zenodo.7316654",
    "ee": "https://archives.ismir.net/ismir2022/paper/000035.pdf",
    "pages": "298-305",
    "abstract": "Anglo-American popular culture has been said to be intricately connected to global popular culture, both shaping and being shaped by popular trends worldwide, yet few research has examined this issue empirically. Our research quantitatively maps the extent of these cultural influences in popular music consumption, by using network analyses to explore cross-cultural popularity in music from 30 countries corresponding to 6 cultural regions (N = 4863 unique songs over six timepoints from 2019-2021). Using Top100 charts from these countries, we constructed a network based on the co-occurrence of songs in charts, and used eigencentrality as an indicator of cross-cultural song popularity. We then compared the country-of-origin of the artists, arousal music features, and socioeconomic indicators. Songs from artists with Anglo-American backgrounds tended to have higher eigencentrality overall, and mixed effects regressions showed that eigencentrality was negatively associated with danceability, and positively associated with spectral energy, and the migrant population of the country (of the charts). Next, using community detection, we observed 11 separate 'communities' in the network. Most communities appeared to be limited by region/culture, but Anglo-American music seemed disproportionally able to transcend cultural boundaries far beyond their geographical borders. We also discuss implications pertaining to cultural hegemony, and the effectiveness of our method in estimating cross-cultural popularity.",
    "zenodo_id": 7316654,
    "dblp_key": null
  },
  {
    "title": "Three related corpora in Middle Byzantine music notation and a preliminary comparative analysis",
    "author": [
      "Polykarpos Polykarpidis",
      "Dionysios Kalofonos",
      "Dimitrios Balageorgos",
      "Christina Anagnostopoulou"
    ],
    "year": "2022",
    "doi": "10.5281/zenodo.7316656",
    "url": "https://doi.org/10.5281/zenodo.7316656",
    "ee": "https://archives.ismir.net/ismir2022/paper/000036.pdf",
    "pages": "306-313",
    "abstract": "The Middle Byzantine notation (MBn) is used to capture the plainchant melodies of eastern Orthodox Christian music from the middle of the 12th century until 1814. In the context of this research, we study the evolution of a subgenre of Byzantine music known as Heirmologic. We present three Heirmologic corpora spanning the periods before, during and after the 16th century. We discuss the challenges we faced during the digitisation process, and the steps we took to overcome them. For the analysis of the three corpora, we apply the three methods, namely notational texture, melodic arch similarity, and Jensen-Shannon distances of Markovian models, the second of which is novel and inspired by the idea of melodic arches. Through these methods, we aim at highlighting the differences of the corpora in order to obtain an outline of the evolution of the subgenre. We observe that the post 16th century Heirmologic pieces are more similar to the 16th century ones, while there is a greater difference with the pre 16th century pieces. This indicates that the 16th century constitutes a turning point in the melodic features of the Heirmologic subgenre.",
    "zenodo_id": 7316656,
    "dblp_key": null
  },
  {
    "title": "Playing Technique Detection by Fusing Note Onset Information in Guzheng Performance",
    "author": [
      "Dichucheng Li",
      "Yulun Wu",
      "Qinyu Li",
      "Jiahao Zhao",
      "Yi Yu",
      "Fan Xia",
      "Wei Li"
    ],
    "year": "2022",
    "doi": "10.5281/zenodo.7316658",
    "url": "https://doi.org/10.5281/zenodo.7316658",
    "ee": "https://archives.ismir.net/ismir2022/paper/000037.pdf",
    "pages": "314-320",
    "abstract": "The Guzheng is a kind of traditional Chinese instruments with diverse playing techniques. Instrument playing techniques (IPT) play an important role in musical performance. However, most of the existing works for IPT detection show low efficiency for variable-length audio and provide no assurance in the generalization as they rely on a single sound bank for training and testing. In this study, we propose an end-to-end Guzheng playing technique detection system using Fully Convolutional Networks that can be applied to variable-length audio. Because each Guzheng playing technique is applied to a note, a dedicated onset detector is trained to divide an audio into several notes and its predictions are fused with frame-wise IPT predictions. During fusion, we add the IPT predictions frame by frame inside each note and get the IPT with the highest probability within each note as the final output of that note. We create a new dataset named GZ_IsoTech from multiple sound banks and real-world recordings for Guzheng performance analysis. Our approach achieves 87.97% in frame-level accuracy and 80.76% in note-level F1-score, outperforming existing works by a large margin, which indicates the effectiveness of our proposed method in IPT detection.",
    "zenodo_id": 7316658,
    "dblp_key": null
  },
  {
    "title": "KDC: an open corpus for computational research of dastgāhi music",
    "author": [
      "Babak Nikzat",
      "Rafael Caro Repetto"
    ],
    "year": "2022",
    "doi": "10.5281/zenodo.7316660",
    "url": "https://doi.org/10.5281/zenodo.7316660",
    "ee": "https://archives.ismir.net/ismir2022/paper/000038.pdf",
    "pages": "321-328",
    "abstract": "Iranian dastgāhi music is considered as the classical repertory of contemporary Iran. In the 19th century, the melodic modes that developed during its long history were grouped in categories, each of them known as dastgāh. The dastgāhi system presents unique features, that have been object of musicological study since its inception. However, computational methods for its research are still scarce, due in good part to the lack of open, well curated corpora. The aim of the KUG Dastgāhi Corpus (KDC) is to contribute to the development of computational corpus driven research for this tradition. KDC is created following the FAIR principles, and in close collaboration with performers and scholars, who contribute to it with annotations and qualitative evaluations. Besides presenting the first version of KDC, in this paper we explore the possibilities that Iranian dastgāhi music offers to computational research. In order to test the performance of state-of-the-art technologies applied to this music tradition, we present preliminary results for several analytical tasks, and discuss thei opportunities and limitations learnt in the process.",
    "zenodo_id": 7316660,
    "dblp_key": null
  },
  {
    "title": "Inaccurate Prediction or Genre Evolution? Rethinking Genre Classification",
    "author": [
      "Ke Nie"
    ],
    "year": "2022",
    "doi": "10.5281/zenodo.7342846",
    "url": "https://doi.org/10.5281/zenodo.7342846",
    "ee": "https://archives.ismir.net/ismir2022/paper/000039.pdf",
    "pages": "329-336",
    "abstract": "The existing MIR research on genre classification primarily focuses on how to classify a song into the “correct” genre while downplaying the fact that genres mutate over time and in response to social change in terms of their musical properties. Songs claiming the same genre can sound very different if they are released years apart, and genres may revive musical traditions from the past. In this paper, I show that the performance of genre classifiers fluctuates as genres evolve. Unsatisfactory performance of the classifiers may not indicate algorithmic flaws but rather the change of genre characteristics. I demonstrate this by studying the case of Chinese Hip-Hop music. Specifically, I collected and analyzed 69,427 songs from four genres (Hip-Hop, Pop, Rock, and Folk) released on a Chinese music platform between 2009 and 2019. Using classifiers trained from the songs in different year cohorts to predict the genre of all the songs, I show how genre classifiers can be used to detect the stylistic shift in Hip-Hop that happened during this period. The paper thus offers a novel, sociological perspective on contending with the much-challenged idea of improving genre classification accuracy for its own sake. However, instead of questioning the effort, I argue that MIR research on genre classification can be helpful for studying genre as a social construct and cultural phenomenon if the pursuit of prediction performance and the cultural meaning of inaccurate prediction are carefully balanced.",
    "zenodo_id": 7342846,
    "dblp_key": null
  },
  {
    "title": "In Search of Sañcāras: Tradition-informed Repeated Melodic Pattern Recognition in Carnatic Music",
    "author": [
      "Thomas Nuttall",
      "Genís Plaja-Roglans",
      "Lara Pearson",
      "Xavier Serra"
    ],
    "year": "2022",
    "doi": "10.5281/zenodo.7316666",
    "url": "https://doi.org/10.5281/zenodo.7316666",
    "ee": "https://archives.ismir.net/ismir2022/paper/000040.pdf",
    "pages": "337-344",
    "abstract": "Carnatic Music is a South Indian art and devotional music practice in which melodic patterns (motifs and phrases), known as sañcāras, play a crucial structural and expressive role. We demonstrate how the combination of transposition invariant features learnt by a Complex Autoencoder (CAE) and predominant pitch tracks extracted using a Frequency-Temporal Attention Network (FTA-Net) can be used to annotate and group regions of variable-length, repeated, melodic patterns in audio recordings of multiple Carnatic Music performances. These models are trained on novel/expert-curated datasets of hundreds of Carnatic audio recordings and the extraction process tailored to account for the unique characteristics of sañcāras in Carnatic Music. Experimental results show that the proposed method is able to identify 54% of all sañcaras annotated by a professional Carnatic vocalist. Code to reproduce and interact with these results is available online.",
    "zenodo_id": 7316666,
    "dblp_key": null
  },
  {
    "title": "Automatic Chinese National Pentatonic Modes Recognition Using Convolutional Neural Network",
    "author": [
      "Zhaowen Wang",
      "Mingjin Che",
      "Yue Yang",
      "Wen Wu Meng",
      "Qinyu Li",
      "Fan Xia",
      "Wei Li"
    ],
    "year": "2022",
    "doi": "10.5281/zenodo.7316670",
    "url": "https://doi.org/10.5281/zenodo.7316670",
    "ee": "https://archives.ismir.net/ismir2022/paper/000041.pdf",
    "pages": "345-352",
    "abstract": "Chinese national pentatonic modes, with five tones of Gong, Shang, Jue, Zhi and Yu as the core, play an essential role in traditional Chinese music culture. After the early twentieth century, with the development of new Chinese music, the ancient Chinese theory of scales gradually developed into a new pentatonic modes theory under the influence of western music. In this paper, we briefly introduce our self-built CNPM (Chinese National Pentatonic Modes) Dataset, then design residual convolutional neural network models to identify which TongGong system the mode belongs, the pitch of tonic, the mode pattern and the mode type from audio signals, in combination with musical domain knowledge. We use both single-task and multi-task models with three strategies for identification, and compare them with a simple template-based baseline method. In experiments, we use seven accuracy metrics to evaluate the models. The results on identifying both the tonic pitch and the pattern of mode correctly achieve an average accuracy of 69.65%. As an initial research on automatic Chinese national pentatonic modes recognition, this work will contribute to the development of multicultural music information retrieval, computational ethnomusicology and five-tone music therapy.",
    "zenodo_id": 7316670,
    "dblp_key": null
  },
  {
    "title": "Teach Yourself Georgian Folk Songs Dataset: A Annotated Corpus Of Traditional Vocal Polyphony",
    "author": [
      "David Gillman",
      "Atalay Kutlay",
      "Uday Goyat"
    ],
    "year": "2022",
    "doi": "10.5281/zenodo.7316672",
    "url": "https://doi.org/10.5281/zenodo.7316672",
    "ee": "https://archives.ismir.net/ismir2022/paper/000042.pdf",
    "pages": "353-360",
    "abstract": "New datasets of non-Western traditional music contribute to the development of knowledge in MIR and allow computational techniques to inform ethnomusicology. We present an annotated dataset of traditional vocal polyphony from two regions of the Republic of Georgia with disparate musical characteristics. The audio for each song consists of four polyphonic recordings of one performance from different microphones. We present a process and workflow that we use to annotate the dataset, which takes advantage of the salience of individual voices in each recording. The process results in an $f_0$ estimate for each vocal part.",
    "zenodo_id": 7316672,
    "dblp_key": null
  },
  {
    "title": "Adapting meter tracking models to Latin American music",
    "author": [
      "Lucas S Maia",
      "Martín Rocamora",
      "Luiz W P Biscainho",
      "Magdalena Fuentes"
    ],
    "year": "2022",
    "doi": "10.5281/zenodo.7385261",
    "url": "https://doi.org/10.5281/zenodo.7385261",
    "ee": "https://archives.ismir.net/ismir2022/paper/000043.pdf",
    "pages": "361-368",
    "abstract": "Beat and downbeat tracking models have improved significantly in recent years with the introduction of deep learning methods. However, despite these improvements, several challenges remain. Particularly, the adaptation of available models to underrepresented music traditions in MIR is usually synonymous with collecting and annotating large amounts of data, which is impractical and time-consuming. Transfer learning, data augmentation, and fine-tuning techniques have been used quite successfully in related tasks and are known to alleviate this bottleneck. Furthermore, when studying these music traditions, models are not required to generalize to multiple mainstream music genres but to perform well in more constrained, homogeneous conditions. In this work, we investigate simple yet effective strategies to adapt beat and downbeat tracking models to two different Latin American music traditions and analyze the feasibility of these adaptations in real-world applications concerning the data and computational requirements. Contrary to common belief, our findings show it is possible to achieve good performance by spending just a few minutes annotating a portion of the data and training a model in a standard CPU machine, with the precise amount of resources needed depending on the task and the complexity of the dataset.",
    "zenodo_id": 7385261,
    "dblp_key": null
  },
  {
    "title": "Critiquing Task- versus Goal-oriented Approaches: A Case for Makam Recognition",
    "author": [
      "Kaustuv Kanti Ganguli",
      "Sertan Şentürk",
      "Carlos Guedes"
    ],
    "year": "2022",
    "doi": "10.5281/zenodo.7316676",
    "url": "https://doi.org/10.5281/zenodo.7316676",
    "ee": "https://archives.ismir.net/ismir2022/paper/000044.pdf",
    "pages": "369-376",
    "abstract": "Computational Musicology and Music Information Retrieval (MIR) address the core musical question under study from a different perspective, often a combination of top-down vs. bottom-up approaches. However, the evaluation metrics for MIR tend to capture the model accuracy in terms of the goal. For instance, mode (melodic framework) recognition is implemented with a goal to evaluate and compare melodic analysis approaches, but it is worth investigating if at all it lends itself as one befitting proxy task. In this work, we aim to review whether the model actually learns the task it is intended for. This is particularly relevant in non-Eurogenetic music repertoires where the grammatical rules are rather prescriptive. We employ methodologies that combine domain-knowledge and data-driven optimizations as a possible way for a comprehensive understanding of these relationships. This is tested on Makam which is one of the understudied corpora in MIR. We evaluate an array of feature-engineering methods on the largest mode recognition dataset curated for Ottoman-Turkish makam music, composed of 1000 recordings in 50 makams. We adapted the time-delayed melody surfaces (TDMS) feature, which in combination with support vector machine (SVM) classifier yields 77.2% recognition accuracy, comparable to the current state-of-the-art. We also address (ethno)musicology-driven tasks with a view to gathering deeper insights into this music, such as tuning, intonation, and melodic similarity. We aim to propose avenues to extend the study to makam characterization over the mere goal of recognizing the mode, to better understand the (dis)similarity space and other plausible musically interesting facets.",
    "zenodo_id": 7316676,
    "dblp_key": null
  },
  {
    "title": "A Dataset for Greek Traditional and Folk Music: Lyra",
    "author": [
      "Charilaos Papaioannou",
      "Ioannis Valiantzas",
      "Theodore Giannakopoulos",
      "Maximos Kaliakatsos-Papakostas",
      "Alexandros Potamianos"
    ],
    "year": "2022",
    "doi": "10.5281/zenodo.7316678",
    "url": "https://doi.org/10.5281/zenodo.7316678",
    "ee": "https://archives.ismir.net/ismir2022/paper/000045.pdf",
    "pages": "377-383",
    "abstract": "Studying under-represented music traditions under the MIR scope is crucial, not only for developing novel analysis tools, but also for unveiling musical functions that might prove useful in studying world musics. This paper presents a dataset for Greek Traditional and Folk music that includes 1570 pieces, summing in around 80 hours of data. The dataset incorporates YouTube timestamped links for retrieving audio and video, along with rich metadata information with regards to instrumentation, geography and genre, among others. The content has been collected from a Greek documentary series that is available online, where academics present music traditions of Greece with live music and dance performance during the show, along with discussions about social, cultural and musicological aspects of the presented music. Therefore, this procedure has resulted in a significant wealth of descriptions regarding a variety of aspects, such as musical genre, places of origin and musical instruments. In addition, the audio recordings were performed under strict production-level specifications, in terms of recording equipment, leading to very clean and homogeneous audio content. In this work, apart from presenting the dataset in detail, we propose a baseline deep-learning classification approach to recognize the involved musicological attributes. The dataset, the baseline classification methods and the models are provided in public repositories. Future directions for further refining the dataset are also discussed.",
    "zenodo_id": 7316678,
    "dblp_key": null
  },
  {
    "title": "Analysis and detection of singing techniques in repertoires of J-POP solo singers",
    "author": [
      "Yuya Yamamoto",
      "Juhan Nam",
      "Hiroko Terasawa"
    ],
    "year": "2022",
    "doi": "10.5281/zenodo.7316680",
    "url": "https://doi.org/10.5281/zenodo.7316680",
    "ee": "https://archives.ismir.net/ismir2022/paper/000046.pdf",
    "pages": "384-391",
    "abstract": "In this paper, we focus on singing techniques within the scope of music information retrieval research. We investigate how singers use singing techniques using real-world recordings of famous solo singers in Japanese popular music songs (J-POP). First, we built a new dataset of singing techniques. The dataset consists of 168 commercial J-POP songs, and each song is annotated using various singing techniques with timestamps and vocal pitch contours. We also present descriptive statistics of singing techniques on the dataset to clarify what and how often singing techniques appear. We further explored the difficulty of the automatic detection of singing techniques using previously proposed machine learning techniques. In the detection, we also investigate the effectiveness of auxiliary information (i.e., pitch and distribution of label duration), not only providing the baseline. The best result achieves 40.4% at macro-average F-measure on nine-way multi-class detection. We provide the annotation of the dataset and its detail on the appendix website.",
    "zenodo_id": 7316680,
    "dblp_key": null
  },
  {
    "title": "Performance MIDI-to-score conversion by neural beat tracking",
    "author": [
      "Lele Liu",
      "Qiuqiang Kong",
      "Veronica Morfi",
      "Emmanouil Benetos"
    ],
    "year": "2022",
    "doi": "10.5281/zenodo.7316682",
    "url": "https://doi.org/10.5281/zenodo.7316682",
    "ee": "https://archives.ismir.net/ismir2022/paper/000047.pdf",
    "pages": "395-402",
    "abstract": "Rhythm quantisation is an essential part of converting performance MIDI recordings into musical scores. Previous works on rhythm quantisation are limited to the use of probabilistic or statistical methods. In this paper, we propose a MIDI-to-score quantisation method using a convolutional-recurrent neural network (CRNN) trained on MIDI note sequences to predict whether notes are on beats. Then, we expand the CRNN model to predict the quantised times for all beat and non-beat notes. Furthermore, we enable the model to predict the key signatures, time signatures, and hand parts of all notes. Our proposed performance MIDI-to-score system achieves significantly better performance compared to commercial software evaluated on the MV2H metric. We release the toolbox for converting performance MIDI into MIDI scores at: https://github.com/cheriell/PM2S .",
    "zenodo_id": 7316682,
    "dblp_key": null
  },
  {
    "title": "Symbolic Music Loop Generation with Neural Discrete Representations",
    "author": [
      "Sangjun Han",
      "Hyeongrae Ihm",
      "Moontae Lee",
      "Woohyung Lim"
    ],
    "year": "2022",
    "doi": "10.5281/zenodo.7342755",
    "url": "https://doi.org/10.5281/zenodo.7342755",
    "ee": "https://archives.ismir.net/ismir2022/paper/000048.pdf",
    "pages": "403-410",
    "abstract": "Since most of music has repetitive structures from motifs to phrases, repeating musical ideas can be a basic operation for music composition. The basic block that we focus on is conceptualized as loops which are essential ingredients of music. Furthermore, meaningful note patterns can be formed in a finite space, so it is sufficient to represent them with combinations of discrete symbols as done in other domains. In this work, we propose symbolic music loop generation via learning discrete representations. We first extract loops from MIDI datasets using a loop detector and then learn an autoregressive model trained by discrete latent codes of the extracted loops. We show that our model outperforms well-known music generative models in terms of both fidelity and diversity, evaluating on random space. Our code and supplementary materials are available at https://github.com/sjhan91/Loop_VQVAE_Official.",
    "zenodo_id": 7342755,
    "dblp_key": null
  },
  {
    "title": "Automatic music mixing with deep learning and out-of-domain data",
    "author": [
      "Marco A Martinez Ramirez",
      "Weihsiang Liao",
      "Chihiro Nagashima",
      "Giorgio Fabbro",
      "Stefan Uhlich",
      "Yuki Mitsufuji"
    ],
    "year": "2022",
    "doi": "10.5281/zenodo.7316688",
    "url": "https://doi.org/10.5281/zenodo.7316688",
    "ee": "https://archives.ismir.net/ismir2022/paper/000049.pdf",
    "pages": "411-418",
    "abstract": "Music mixing traditionally involves recording instruments in the form of clean, individual tracks and blending them into a final mixture using audio effects and expert knowledge (e.g., a mixing engineer). The automation of music production tasks has become an emerging field in recent years, where rule-based methods and machine learning approaches have been explored. Nevertheless, the lack of dry or clean instrument recordings limits the performance of such models, which is still far from professional human-made mixes. We explore whether we can use out-of-domain data such as wet or processed multitrack music recordings and repurpose it to train supervised deep learning models that can bridge the current gap in automatic mixing quality. To achieve this we propose a novel data preprocessing method that allows the models to perform automatic music mixing. We also redesigned a listening test method for evaluating music mixing systems. We validate our results through such subjective tests using highly experienced mixing engineers as participants.",
    "zenodo_id": 7316688,
    "dblp_key": null
  },
  {
    "title": "Music-STAR: a Style Translation system for Audio-based Re-instrumentation",
    "author": [
      "Mahshid Alinoori",
      "Vassilios Tzerpos"
    ],
    "year": "2022",
    "doi": "10.5281/zenodo.7316690",
    "url": "https://doi.org/10.5281/zenodo.7316690",
    "ee": "https://archives.ismir.net/ismir2022/paper/000050.pdf",
    "pages": "419-426",
    "abstract": "Music style translation aims to generate variations of existing pieces of music by altering the style-related characteristics of the original piece while content, such as the melody, remains unchanged. These alterations could involve timbre translation, re-harmonization, or music rearrangement. Previous studies have achieved promising results utilizing time-frequency and symbolic music representations. Music style translation on raw audio has also been investigated and applied to single-instrument pieces. Although processing raw audio is more challenging, it provides richer information about timbres, dynamics, and articulations.In this paper, we introduce Music-STAR, the first audio-based translation system that translates the existing instruments in a piece into a set of target instruments without using source separation. To conduct our experiments, we also present an audio dataset that contains two-track pieces performed by two instrument sets alongside their stems. We carry out subjective and objective evaluations to compare Music-STAR with a variety of baseline methods and demonstrate its superiority.",
    "zenodo_id": 7316690,
    "dblp_key": null
  },
  {
    "title": "Learning Unsupervised Hierarchies of Audio Concepts",
    "author": [
      "Darius Afchar",
      "Romain Hennequin",
      "Vincent Guigue"
    ],
    "year": "2022",
    "doi": "10.5281/zenodo.7316692",
    "url": "https://doi.org/10.5281/zenodo.7316692",
    "ee": "https://archives.ismir.net/ismir2022/paper/000051.pdf",
    "pages": "427-436",
    "abstract": "Music signals are difficult to interpret from their low-level features, perhaps even more than images: e.g. highlighting part of a spectrogram or an image is often insufficient to convey high-level ideas that are genuinely relevant to humans. In computer vision, concept learning was therein proposed to adjust explanations to the right abstraction level (e.g. detect clinical concepts from radiographs). These methods have yet to be used for MIR.In this paper, we adapt concept learning to the realm of music, with its particularities. For instance, music concepts are typically non-independent and of mixed nature (e.g. genre, instruments, mood), unlike previous work that assumed disentangled concepts.We propose a method to learn numerous music concepts from audio and then automatically hierarchise them to expose their mutual relationships. We conduct experiments on datasets of playlists from a music streaming service, serving as a few annotated examples for diverse concepts. Evaluations show that the mined hierarchies are aligned with both ground-truth hierarchies of concepts -- when available -- and with proxy sources of concept similarity in the general case.",
    "zenodo_id": 7316692,
    "dblp_key": null
  },
  {
    "title": "Multi-objective Hyper-parameter Optimization of Behavioral Song Embeddings",
    "author": [
      "Massimo Quadrana",
      "Antoine Larreche-Mouly",
      "Matthias Mauch"
    ],
    "year": "2022",
    "doi": "10.5281/zenodo.7316694",
    "url": "https://doi.org/10.5281/zenodo.7316694",
    "ee": "https://archives.ismir.net/ismir2022/paper/000052.pdf",
    "pages": "437-445",
    "abstract": "Song embeddings are a key component of most music recommendation engines. In this work, we study the hyper-parameter optimization of behavioral song embeddings based on Word2Vec on a selection of downstream tasks, namely next-song recommendation, false neighbor rejection, and artist and genre clustering. We present new optimization objectives and metrics to monitor the effects of hyper-parameter optimization. We show that single-objective optimization can cause side effects on the non optimized metrics and propose a simple multi-objective optimization to mitigate these effects.We find that next-song recommendation quality of Word2Vec is anti-correlated with song popularity, and we show how song embedding optimization can balance performance across different popularity levels.We then show potential positive downstream effects on the task of play prediction.Finally, we provide useful insights on the effects of training dataset scale by testing hyper-parameter optimization on an industry-scale dataset.",
    "zenodo_id": 7316694,
    "dblp_key": null
  },
  {
    "title": "ATEPP: A Dataset of Automatically Transcribed Expressive Piano Performance",
    "author": [
      "Huan Zhang",
      "Jingjing Tang",
      "Syed Rm Rafee",
      "Simon Dixon",
      "George Fazekas",
      "Geraint A. Wiggins"
    ],
    "year": "2022",
    "doi": "10.5281/zenodo.7342764",
    "url": "https://doi.org/10.5281/zenodo.7342764",
    "ee": "https://archives.ismir.net/ismir2022/paper/000053.pdf",
    "pages": "446-453",
    "abstract": "Computational models of expressive piano performance rely on attributes like tempo, timing, dynamics and pedalling. Despite some promising models for performance assessment and performance rendering, results are limited by the scale, breadth and uniformity of existing datasets. In this paper, we present ATEPP, a dataset that contains 1000 hours of performances of standard piano repertoire by 49 world-renowned pianists, organized and aligned by compositions and movements for comparative studies. Scores in MusicXML format are also available for around half of the tracks. We first evaluate and verify the use of transcribed MIDI for representing expressive performance with a listening evaluation that involves recent transcription models. Then, the process of sourcing and curating the dataset is outlined, including composition entity resolution and a pipeline for audio matching and solo filtering. Finally, we conduct baseline experiments for performer identification and performance rendering on our datasets, demonstrating its potential in generalizing expressive features of individual performing style.",
    "zenodo_id": 7342764,
    "dblp_key": null
  },
  {
    "title": "PDAugment: Data Augmentation by Pitch and Duration Adjustments for Automatic Lyrics Transcription",
    "author": [
      "Chen Zhang",
      "Jiaxing Yu",
      "Luchin Chang",
      "Xu Tan",
      "Jiawei Chen",
      "Tao Qin",
      "Kejun Zhang"
    ],
    "year": "2022",
    "doi": "10.5281/zenodo.7316698",
    "url": "https://doi.org/10.5281/zenodo.7316698",
    "ee": "https://archives.ismir.net/ismir2022/paper/000054.pdf",
    "pages": "454-461",
    "abstract": "Automatic lyrics transcription (ALT), which can be regarded as automatic speech recognition (ASR) on singing voice, is an interesting and practical topic in academia and industry. ALT has not been well developed mainly due to the dearth of the paired singing voice and lyrics datasets for model training. Considering that there is a large amount of ASR training data, a straightforward method is to leverage ASR data to enhance ALT training. However, the improvement is marginal when training the ALT system directly with ASR data, because of the gap between the singing voice and standard speech data which is rooted in music-specific acoustic characteristics in singing voice. In this paper, we propose PDAugment, a data augmentation method that adjusts pitch and duration of speech at syllable level under the guidance of music scores to help ALT training. Specifically, we adjust the pitch and duration of each syllable in natural speech to those of the corresponding note extracted from music scores, to narrow the gap between natural speech and singing voice. Experiments on DSing30 and Dali corpus show that the ALT system equipped with our PDAugment outperforms previous state-of-the-art systems by 5.9% and 18.1% WERs respectively, demonstrating the effectiveness of PDAugment for ALT.",
    "zenodo_id": 7316698,
    "dblp_key": null
  },
  {
    "title": "Parameter Sensitivity of Deep-Feature based Evaluation Metrics for Audio Textures",
    "author": [
      "Chitralekha Gupta",
      "Yize Wei",
      "Zequn Gong",
      "Purnima Kamath",
      "Zhuoyao Li",
      "Lonce Wyse"
    ],
    "year": "2022",
    "doi": "10.5281/zenodo.7342809",
    "url": "https://doi.org/10.5281/zenodo.7342809",
    "ee": "https://archives.ismir.net/ismir2022/paper/000055.pdf",
    "pages": "462-468",
    "abstract": "Standard evaluation metrics such as the Inception score and Fréchet Audio Distance provide a general audio quality distance metric between the synthesized audio and reference clean audio. However, the sensitivity of these metrics to variations in the statistical parameters that define an audio texture is not well studied. In this work, we provide a systematic study of the sensitivity of some of the existing audio quality evaluation metrics to parameter variations in audio textures. Furthermore, we also study three more potentially parameter-sensitive metrics for audio texture synthesis, (a) a Gram matrix based distance, (b) an Accumulated Gram metric using a summarized version of the Gram matrices, and (c) a cochlear-model based statistical features metric. These metrics use deep features that summarize the statistics of any given audio texture, thus being inherently sensitive to variations in the statistical parameters that define an audio texture. We study and evaluate the sensitivity of existing standard metrics as well as Gram matrix and cochlear-model based metrics in response to control-parameter variations for audio textures across a wide range of texture and parameter types, and validate with subjective evaluation. We find that each of the metrics is sensitive to different sets of texture-parameter types. This is the first step towards investigating objective metrics for assessing parameter sensitivity in audio textures.",
    "zenodo_id": 7342809,
    "dblp_key": null
  },
  {
    "title": "Stability of Symbolic Feature Group Importance in the Context of Multi-Modal Music Classification",
    "author": [
      "Igor Vatolkin",
      "Cory Mckay"
    ],
    "year": "2022",
    "doi": "10.5281/zenodo.7316702",
    "url": "https://doi.org/10.5281/zenodo.7316702",
    "ee": "https://archives.ismir.net/ismir2022/paper/000056.pdf",
    "pages": "469-476",
    "abstract": "Multi-modal music classification creates supervised models trained on features from different sources (modalities): the audio signal, the score, lyrics, album covers, expert tags, etc. A concept of “multi-group feature importance” not only helps to measure the individual relevance of features of a feature type under investigation (such as the instruments present in a piece), but also serves to quantify the potential for further improving classification by adding features from other feature types or extracted from different kinds of sources, based on a multi-objective analysis of feature sets after evolutionary feature selection. In this study, we investigate the stability of feature group importance when different classification methods and different measures of classification quality are applied. Since musical scores are particularly helpful in deriving semantically meaningful, robust genre characteristics, we focus on the feature groups analyzed by the jSymbolic feature extraction software, which describe properties associated with instrumentation, basic pitch statistics, melody, chords, tempo, and other rhythmic aspects. These symbolic features are analyzed in the context of musical information drawn from five other modalities, and experiments are conducted involving two datasets, one small and one large. The results show that, although some feature groups can remain similarly important compared to others, differences can also be evident in various applications, and can depend on the particular classifier and evaluation measure being used. Insights drawn from this type of analysis can potentially be helpful in effectively matching specific features or feature groups to particular classifiers and evaluation measures in future feature-based MIR research.",
    "zenodo_id": 7316702,
    "dblp_key": null
  },
  {
    "title": "Multi-pitch Estimation meets Microphone Mismatch: Applicability of Domain Adaptation",
    "author": [
      "Franca Bittner",
      "Marcel Gonzalez",
      "Maike L Richter",
      "Hanna Lukashevich",
      "Jakob Abeßer"
    ],
    "year": "2022",
    "doi": "10.5281/zenodo.7342840",
    "url": "https://doi.org/10.5281/zenodo.7342840",
    "ee": "https://archives.ismir.net/ismir2022/paper/000057.pdf",
    "pages": "477-484",
    "abstract": "The performance of machine learning (ML) models is known to be affected by discrepancies between training (source) and real-world (target) data distributions. This problem is referred to as domain shift and is commonly approached using domain adaptation (DA) methods. As one relevant scenario, automatic piano transcription algorithms in music learning applications potentially suffer from domain shift since pianos are recorded in different acoustic conditions using various devices. Yet, most currently available datasets for piano transcription only cover ideal recording situations with high-quality microphones. Consequently, a transcription model trained on these datasets will face a mismatch between source and target data in real-world scenarios. To address this issue, we employ a recently proposed dataset which includes annotated piano recordings covering typical real-life recording settings for a piano learning application on mobile devices. We first quantify the influence of the domain shift on the performance of a deep learning-based piano multi-pitch estimation (MPE) algorithm. Then, we employ and evaluate four unsupervised DA methods to reduce domain shift. Our results show that the studied MPE model is surprisingly robust to domain shift in microphone mismatch scenarios and the DA methods do not notably improve the transcription performance.",
    "zenodo_id": 7342840,
    "dblp_key": null
  },
  {
    "title": "Melody transcription via generative pre-training",
    "author": [
      "Chris Donahue",
      "John Thickstun",
      "Percy Liang"
    ],
    "year": "2022",
    "doi": "10.5281/zenodo.7316706",
    "url": "https://doi.org/10.5281/zenodo.7316706",
    "ee": "https://archives.ismir.net/ismir2022/paper/000058.pdf",
    "pages": "485-492",
    "abstract": "Despite the central role that melody plays in music perception, it remains an open challenge in MIR to reliably detect the notes of the melody present in an arbitrary music recording. A key challenge in *melody transcription* is building methods which can handle broad audio containing any number of instrument ensembles and musical styles---existing strategies work well for some melody instruments or styles but not all. To confront this challenge, we leverage representations from Jukebox (Dhariwal et al. 2020), a generative model of broad music audio, thereby improving performance on melody transcription by 20% relative to conventional spectrogram features. Another obstacle in melody transcription is a lack of training data---we derive a new dataset containing 50 hours of melody transcriptions from crowdsourced annotations of broad music. The combination of generative pre-training and a new dataset for this task results in 77% stronger performance on melody transcription relative to the strongest available baseline. By pairing our new melody transcription approach with solutions for beat detection, key estimation, and chord recognition, we build a system capable of transcribing human-readable lead sheets directly from music audio.",
    "zenodo_id": 7316706,
    "dblp_key": null
  },
  {
    "title": "Source Separation of Piano Concertos with Test-Time Adaptation",
    "author": [
      "Yigitcan Özer",
      "Meinard Müller"
    ],
    "year": "2022",
    "doi": "10.5281/zenodo.7316708",
    "url": "https://doi.org/10.5281/zenodo.7316708",
    "ee": "https://archives.ismir.net/ismir2022/paper/000059.pdf",
    "pages": "493-500",
    "abstract": "Music source separation (MSS) aims at decomposing a music recording into constituent sources, such as a lead instrument and the accompaniment. Despite the difficulties in MSS due to the high correlation of musical sources in time and frequency, deep neural networks (DNNs) have led to substantial improvements to accomplish this task. For training supervised machine learning models such as DNNs, isolated sources are required. In the case of popular music, one can exploit open-source datasets which involve multitrack recordings of vocals, bass, and drums. For western classical music, however, isolated sources are generally not available. In this article, we consider the case of piano concertos, which are composed for a pianist typically accompanied by an orchestra. The lack of multitrack recordings makes training supervised machine learning models for the separation of piano and orchestra challenging. To overcome this problem, we generate artificial training material by randomly mixing sections of the solo piano repertoire (e.g., piano sonatas) and orchestral pieces without piano (e.g., symphonies) to train state-of-the-art DNN models for MSS. As our main contribution, we propose a test-time adaptation (TTA) procedure, which exploits random mixtures of the piano-only and orchestra-only parts in the test data to further improve the separation quality.",
    "zenodo_id": 7316708,
    "dblp_key": null
  },
  {
    "title": "Counterpoint Error-Detection Tools for Optical Music Recognition of Renaissance Polyphonic Music",
    "author": [
      "Martha E Thomae Elias",
      "Julie Cumming",
      "Ichiro Fujinaga"
    ],
    "year": "2022",
    "doi": "10.5281/zenodo.7316710",
    "url": "https://doi.org/10.5281/zenodo.7316710",
    "ee": "https://archives.ismir.net/ismir2022/paper/000060.pdf",
    "pages": "501-508",
    "abstract": "This paper discusses part of a larger project to preserve and increase access to Guatemalan music sources written in mensural notation by using a digitization and music information retrieval (MIR) workflow to obtain both digital images and symbolic scores with editorial corrections. The workflow involves MIR tools such as optical music recognition (OMR), automatic voice alignment for mensural notation, editorial correction software, and computational counterpoint error detection. In this paper, we evaluate whether the use of automatic counterpoint error-detection tools makes the correction process more efficient. The results confirm that marking illegal dissonances in the score following the rules of Renaissance counterpoint indeed makes the process of editorial correction of scribal errors in Renaissance music more efficient by reducing the time taken and improving the accuracy of such corrections. Moreover, marking the illegal dissonances in the score also allowed us to catch OMR errors that had passed through undetected at a previous stage of the workflow.",
    "zenodo_id": 7316710,
    "dblp_key": null
  },
  {
    "title": "A Dataset of Symbolic Texture Annotations in Mozart Piano Sonatas",
    "author": [
      "Louis Couturier",
      "Louis Bigo",
      "Florence Leve"
    ],
    "year": "2022",
    "doi": "10.5281/zenodo.7316712",
    "url": "https://doi.org/10.5281/zenodo.7316712",
    "ee": "https://archives.ismir.net/ismir2022/paper/000061.pdf",
    "pages": "509-516",
    "abstract": "Musical scores are generally analyzed under different aspects, notably melody, harmony, rhythm, but also through their texture, although this last concept is arguably more delicate to formalize. Symbolic texture depicts how sounding components are organized in the score. It outlines the density of elements, their heterogeneity, role and interactions. In this paper, we release a set of manual annotations for each bar of 9 movements among early piano sonatas by W. A. Mozart, totaling 1164 labels that follow a syntax dedicated to piano score texture. A quantitative analysis of the annotations highlights some characteristic textural features in the corpus. In addition, we present and release the implementation of low-level descriptors of symbolic texture. These descriptors can be correlated with texture annotations and used in different machine-learning tasks. Along with provided data, they offer promising applications in computer assisted music analysis and composition.",
    "zenodo_id": 7316712,
    "dblp_key": null
  },
  {
    "title": "Violin Etudes: A Comprehensive Dataset for f0 Estimation and Performance Analysis",
    "author": [
      "Nazif Can Tamer",
      "Pedro Ramoneda",
      "Xavier Serra"
    ],
    "year": "2022",
    "doi": "10.5281/zenodo.7316714",
    "url": "https://doi.org/10.5281/zenodo.7316714",
    "ee": "https://archives.ismir.net/ismir2022/paper/000062.pdf",
    "pages": "517-524",
    "abstract": "Violin performance analysis requires accurate and robust f0 estimates to give feedback on the playing accuracy. Despite the recent advancements in data-driven f0 estimators, their application to performance analysis remains a challenge due to style-specific and dataset-induced biases. In this paper, we address this problem by introducing Violin Etudes, a 27.8-hours violin performance dataset constructed with domain knowledge in instrument pedagogy and a novel automatic f0-labeling paradigm. Experimental results on unseen datasets show that the CREPE f0 estimator trained on Violin Etudes outperforms the widely-used pre-trained version trained on multiple manually-labeled datasets. Further preliminary findings suggest that (i) existing data-driven f0 estimators may overfit to equal temperament, and (ii) iterative re-labeling regularized by our novel Constrained Harmonic Resynthesis method can simultaneously enhance datasets and f0 estimators. Our dataset curation methodology is easily scalable to other instruments owing to the quantity of pedagogical data online. It also supports a range of MIR research directions thanks to the performance difficulty labels from educational institutions.",
    "zenodo_id": 7316714,
    "dblp_key": null
  },
  {
    "title": "Checklist Models for Improved Output Fluency in Piano Fingering Prediction",
    "author": [
      "Nikita Srivatsan",
      "Taylor Berg-Kirkpatrick"
    ],
    "year": "2022",
    "doi": "10.5281/zenodo.7316716",
    "url": "https://doi.org/10.5281/zenodo.7316716",
    "ee": "https://archives.ismir.net/ismir2022/paper/000063.pdf",
    "pages": "525-531",
    "abstract": "In this work we present a new approach for the task of predicting fingerings for piano music. While prior neural approaches have often treated this as a sequence tagging problem with independent predictions, we put forward a checklist system, trained via reinforcement learning, that maintains a representation of recent predictions in addition to a hidden state, allowing it to learn soft constraints on output structure. We also demonstrate that by modifying input representations --- which in prior work using neural models have often taken the form of one-hot encodings over individual keys on the piano --- to encode relative position on the keyboard to the prior note instead, we can achieve much better performance. Additionally, we reassess the use of raw per-note labeling precision as an evaluation metric, noting that it does not adequately measure the fluency, i.e. human playability, of a model's output. To this end, we compare methods across several statistics which track the frequency of adjacent finger predictions that while independently reasonable would be physically challenging to perform in sequence, and implement a reinforcement learning strategy to minimize these as part of our training loss. Finally through human expert evaluation, we demonstrate significant gains in performability directly attributable to improvements with respect to these metrics.",
    "zenodo_id": 7316716,
    "dblp_key": null
  },
  {
    "title": "Sonus Texere! Automated Dense Soundtrack Construction for Books using Movie Adaptations",
    "author": [
      "Jaidev Shriram",
      "Makarand Tapaswi",
      "Vinoo Alluri"
    ],
    "year": "2022",
    "doi": "10.5281/zenodo.7372149",
    "url": "https://doi.org/10.5281/zenodo.7372149",
    "ee": "https://archives.ismir.net/ismir2022/paper/000064.pdf",
    "pages": "535-542",
    "abstract": "Reading, much like music listening, is an immersive experience that transports readers while taking them on an emotional journey. Listening to complementary music has the potential to amplify the reading experience, especially when the music is stylistically cohesive and emotionally relevant. In this paper, we propose the first fully automatic method to build a dense soundtrack for books, which can play high-quality instrumental music for the entirety of the reading duration. Our work employs a unique text processing and music weaving pipeline that determines the context and emotional composition of scenes in a chapter. This allows our method to identify and play relevant excerpts from the soundtrack of the book's movie adaptation. By relying on the movie composer's craftsmanship, our book soundtracks include expert-made motifs and other scene-specific musical characteristics. We validate the design decisions of our approach through a perceptual study. Our readers note that the book soundtrack greatly enhanced their reading experience, due to high immersiveness granted via uninterrupted and style-consistent music, and a heightened emotional state attained via high precision emotion and scene context recognition.",
    "zenodo_id": 7372149,
    "dblp_key": null
  },
  {
    "title": "Musika! Fast Infinite Waveform Music Generation",
    "author": [
      "Marco Pasini",
      "Jan Schlüter"
    ],
    "year": "2022",
    "doi": "10.5281/zenodo.7316720",
    "url": "https://doi.org/10.5281/zenodo.7316720",
    "ee": "https://archives.ismir.net/ismir2022/paper/000065.pdf",
    "pages": "543-550",
    "abstract": "Fast and user-controllable music generation could enable novel ways of composing or performing music. However, state-of-the-art music generation systems require large amounts of data and computational resources for training, and are slow at inference. This makes them impractical for real-time interactive use. In this work, we introduce Musika, a music generation system that can be trained on hundreds of hours of music using a single consumer GPU, and that allows for much faster than real-time generation of music of arbitrary length on a consumer CPU. We achieve this by first learning a compact invertible representation of spectrogram magnitudes and phases with adversarial autoencoders, then training a Generative Adversarial Network (GAN) on this representation for a particular music domain. A latent coordinate system enables generating arbitrarily long sequences of excerpts in parallel, while a global context vector allows the music to remain stylistically coherent through time. We perform quantitative evaluations to assess the quality of the generated samples and showcase options for user control in piano and techno music generation. We release the source code and pretrained autoencoder weights at github.com/marcoppasini/musika, such that a GAN can be trained on a new music domain with a single GPU in a matter of hours.",
    "zenodo_id": 7316720,
    "dblp_key": null
  },
  {
    "title": "Symphony Generation with Permutation Invariant Language Model",
    "author": [
      "Jiafeng Liu",
      "Yuanliang Dong",
      "Zehua Cheng",
      "Xinran Zhang",
      "Xiaobing Li",
      "Feng Yu",
      "Maosong Sun"
    ],
    "year": "2022",
    "doi": "10.5281/zenodo.7316722",
    "url": "https://doi.org/10.5281/zenodo.7316722",
    "ee": "https://archives.ismir.net/ismir2022/paper/000066.pdf",
    "pages": "551-558",
    "abstract": "In this work, we propose a permutation invariant language model, SymphonyNet, as a solution for symbolic symphony music generation. We propose a novel Multi-track Multi-instrument Repeatable (MMR) representation for symphonic music and model the music sequence using a Transformer-based auto-regressive language model with specific 3-D positional embedding. To overcome length overflow when modeling extra-long symphony tokens, we also propose a modified Byte Pair Encoding algorithm (Music BPE) for music tokens and introduce a novel linear transformer decoder architecture as a backbone. Meanwhile, we train the decoder to learn automatic orchestration as a joint task by masking instrument information from the input. We also introduce a large-scale symbolic symphony dataset for the advance of symphony generation research. Empirical results show that the proposed approach can generate coherent, novel, complex and harmonious symphony as a pioneer solution for multi-track multi-instrument symbolic music generation.",
    "zenodo_id": 7316722,
    "dblp_key": null
  },
  {
    "title": "MuLan: A Joint Embedding of Music Audio and Natural Language",
    "author": [
      "Qingqing Huang",
      "Aren Jansen",
      "Joonseok Lee",
      "Ravi Ganti",
      "Judith Yue Li",
      "Daniel P W Ellis"
    ],
    "year": "2022",
    "doi": "10.5281/zenodo.7316724",
    "url": "https://doi.org/10.5281/zenodo.7316724",
    "ee": "https://archives.ismir.net/ismir2022/paper/000067.pdf",
    "pages": "559-566",
    "abstract": "Music tagging and content-based retrieval systems have traditionally been constructed using pre-defined ontologies covering a rigid set of music attributes or text queries. This paper presents MuLan: a first attempt at a new generation of acoustic models that link music audio directly to unconstrained natural language music descriptions. MuLan takes the form of a two-tower, joint audio-text embedding model trained using 44 million music recordings (370K hours) and weakly-associated, free-form text annotations. Through its compatibility with a wide range of music genres and text styles (including conventional music tags), the resulting audio-text representation subsumes existing ontologies while graduating to true zero-shot functionalities. We demonstrate the versatility of the MuLan embeddings with a range of experiments including transfer learning, zero-shot music tagging, language understanding in the music domain, and cross-modal retrieval applications.",
    "zenodo_id": 7316724,
    "dblp_key": null
  },
  {
    "title": "MeloForm: Generating Melody with Musical Form based on Expert Systems and Neural Networks",
    "author": [
      "Peiling Lu",
      "Xu Tan",
      "Botao Yu",
      "Tao Qin",
      "Sheng Zhao",
      "Tie-Yan Liu"
    ],
    "year": "2022",
    "doi": "10.5281/zenodo.7342745",
    "url": "https://doi.org/10.5281/zenodo.7342745",
    "ee": "https://archives.ismir.net/ismir2022/paper/000068.pdf",
    "pages": "567-574",
    "abstract": "Human usually composes music by organizing elements according to the musical form to express music ideas. However, for neural network-based music generation, it is difficult to do so due to the lack of labelled data on musical form. In this paper, we develop MeloForm, a system that generates melody with musical form using expert systems and neural networks. Specifically, 1) we design an expert system to generate a melody by developing musical elements from motifs to phrases then to sections with repetitions and variations according to pre-given musical form; 2) considering the generated melody is lack of musical richness, we design a Transformer based refinement model to improve the melody without changing its musical form. MeloForm enjoys the advantages of precise musical form control by expert systems and musical richness learning via neural models. Both subjective and objective experimental evaluations demonstrate that MeloForm generates melodies with precise musical form control with 97.79% accuracy, and outperforms baseline systems in terms of subjective evaluation score by 0.75, 0.50, 0.86 and 0.89 in structure, thematic, richness and overall quality, without any labelled musical form data. Besides, MeloForm can support various kinds of forms, such as verse and chorus form, rondo form, variational form, sonata form, etc.",
    "zenodo_id": 7342745,
    "dblp_key": null
  },
  {
    "title": "Towards robust music source separation on loud commercial music",
    "author": [
      "Chang-Bin Jeon",
      "Kyogu Lee"
    ],
    "year": "2022",
    "doi": "10.5281/zenodo.7342777",
    "url": "https://doi.org/10.5281/zenodo.7342777",
    "ee": "https://archives.ismir.net/ismir2022/paper/000069.pdf",
    "pages": "575-582",
    "abstract": "Nowadays, commercial music has extreme loudness and heavily compressed dynamic range compared to the past. Yet, in music source separation, these characteristics have not been thoroughly considered, resulting in the domain mismatch between the laboratory and the real world. In this paper, we confirmed that this domain mismatch negatively affect the performance of the music source separation networks. To this end, we first created the out-of-domain evaluation datasets, musdb-L and XL, by mimicking the music mastering process. Then, we quantitatively verify that the performance of the state-of-the-art algorithms significantly deteriorated in our datasets. Lastly, we proposed LimitAug data augmentation method to reduce the domain mismatch, which utilizes an online limiter during the training data sampling process. We confirmed that it not only alleviates the performance degradation on our out-of-domain datasets, but also results in higher performance on in-domain data.",
    "zenodo_id": 7342777,
    "dblp_key": null
  },
  {
    "title": "Towards Quantifying the Strength of Music Scenes Using Live Event Data",
    "author": [
      "Michael Zhou",
      "Andrew Mcgraw",
      "Douglas R Turnbull"
    ],
    "year": "2022",
    "doi": "10.5281/zenodo.7316730",
    "url": "https://doi.org/10.5281/zenodo.7316730",
    "ee": "https://archives.ismir.net/ismir2022/paper/000070.pdf",
    "pages": "583-590",
    "abstract": "There are many benefits for a community when there is a vibrant local music scene (e.g., increased mental & physical well-being, increased economic activity) and there are many factors that contribute to an environment in which a live music scene can thrive (e.g., available performance spaces, helpful government policies). In this paper, we explore using an estimate of the live music event rate (LMER) as a rough indicator to measure the strength of a local music scene. We define LMER as the number of music shows per 100,000 people per year and then explore how this indicator is (or is not) correlated with 28 other socioeconomic indicators. To do this, we analyze a set of 308,051 music events from 2019 across 1,139 cities in the United States. Our findings reveal that factors related to transportation (e.g., high walkability), population (high density), economics (high employment rate), age (high proportion of individuals age 20-29), and education (bachelor’s degree or higher) are strongly correlated with having a high number of live music events. Conversely, we did not find statistically significant evidence that other indica- tors (e.g., racial diversity) are correlated.",
    "zenodo_id": 7316730,
    "dblp_key": null
  },
  {
    "title": "Learning Multi-Level Representations for Hierarchical Music Structure Analysis.",
    "author": [
      "Morgan Buisson",
      "Brian Mcfee",
      "Slim Essid",
      "Hélène C.  Crayencour Crayencour"
    ],
    "year": "2022",
    "doi": "10.5281/zenodo.7343060",
    "url": "https://doi.org/10.5281/zenodo.7343060",
    "ee": "https://archives.ismir.net/ismir2022/paper/000071.pdf",
    "pages": "591-597",
    "abstract": "Recent work in music structure analysis has shown the potential of deep features to highlight the underlying structure of music audio signals. Despite promising results achieved by such representations, dealing with the inherent hierarchical aspect of music structure remains a challenging problem. Because different levels of segmentation can be considered as equally valid, specifically designed representations should be optimized to improve hierarchical structure analysis. In this work, we explore unsupervised learning of such representations using a contrastive approach operating at different time-scales. We evaluate the proposed system on flat and multi-level music segmentation. By leveraging both time and the hierarchical organization of music structure, we show that the obtained deep embeddings can encode meaningful patterns and improve segmentation at various levels of granularity.",
    "zenodo_id": 7343060,
    "dblp_key": null
  },
  {
    "title": "Multi-instrument Music Synthesis with Spectrogram Diffusion",
    "author": [
      "Curtis Hawthorne",
      "Ian Simon",
      "Adam Roberts",
      "Neil Zeghidour",
      "Joshua Gardner",
      "Ethan Manilow",
      "Jesse Engel"
    ],
    "year": "2022",
    "doi": "10.5281/zenodo.7316734",
    "url": "https://doi.org/10.5281/zenodo.7316734",
    "ee": "https://archives.ismir.net/ismir2022/paper/000072.pdf",
    "pages": "598-607",
    "abstract": "An ideal music synthesizer should be both interactive and expressive, generating high-fidelity audio in realtime for arbitrary combinations of instruments and notes. Recent neural synthesizers have exhibited a tradeoff between domain-specific models that offer detailed control of only specific instruments, or raw waveform models that can train on any music but with minimal control and slow generation. In this work, we focus on a middle ground of neural synthesizers that can generate audio from MIDI sequences with arbitrary combinations of instruments in realtime. This enables training on a wide range of transcription datasets with a single model, which in turn offers note-level control of composition and instrumentation across a wide range of instruments. We use a simple two-stage process: MIDI to spectrograms with an encoder-decoder Transformer, then spectrograms to audio with a generative adversarial network (GAN) spectrogram inverter. We compare training the decoder as an autoregressive model and as a Denoising Diffusion Probabilistic Model (DDPM) and find that the DDPM approach is superior both qualitatively and as measured by audio reconstruction and Fréchet distance metrics. Given the interactivity and generality of this approach, we find this to be a promising first step towards interactive and expressive neural synthesis for arbitrary combinations of instruments and notes.",
    "zenodo_id": 7316734,
    "dblp_key": null
  },
  {
    "title": "DDX7: Differentiable FM Synthesis of Musical Instrument Sounds",
    "author": [
      "Franco Caspe",
      "Andrew Mcpherson",
      "Mark Sandler"
    ],
    "year": "2022",
    "doi": "10.5281/zenodo.7343063",
    "url": "https://doi.org/10.5281/zenodo.7343063",
    "ee": "https://archives.ismir.net/ismir2022/paper/000073.pdf",
    "pages": "608-616",
    "abstract": "FM Synthesis is a well-known algorithm used to generate complex timbre from a compact set of design primitives. Typically featuring a MIDI interface, it is usually impractical to control it from an audio source. On the other hand, Differentiable Digital Signal Processing (DDSP) has enabled nuanced audio rendering by Deep Neural Networks (DNNs) that learn to control differentiable synthesis layers from arbitrary sound inputs. The training process involves a corpus of audio for supervision, and spectral reconstruction loss functions. Such functions, while being great to match spectral amplitudes, present a lack of pitch direction which can hinder the joint optimization of the parameters of FM synthesizers. In this paper, we take steps towards enabling continuous control of a well-established FM synthesis architecture from an audio input. Firstly, we discuss a set of design constraints that ease spectral optimization of a differentiable FM synthesizer via a standard reconstruction loss. Next, we present Differentiable DX7 (DDX7), a lightweight architecture for neural FM resynthesis of musical instrument sounds in terms of a compact set of parameters. We train the model on instrument samples extracted from the URMP dataset, and quantitatively demonstrate its comparable audio quality against selected benchmarks.",
    "zenodo_id": 7343063,
    "dblp_key": null
  },
  {
    "title": "Singing beat tracking with Self-supervised front-end and linear transformers",
    "author": [
      "Mojtaba Heydari",
      "Zhiyao Duan"
    ],
    "year": "2022",
    "doi": "10.5281/zenodo.7316738",
    "url": "https://doi.org/10.5281/zenodo.7316738",
    "ee": "https://archives.ismir.net/ismir2022/paper/000074.pdf",
    "pages": "617-624",
    "abstract": "Tracking beats of singing voices without the presence of musical accompaniment can find many applications in music production, automatic song arrangement, and social media interaction. Its main challenge is the lack of strong rhythmic and harmonic patterns that are important for music rhythmic analysis in general. Even for human listeners, this can be a challenging task. As a result, existing music beat tracking systems fail to deliver satisfactory performance on singing voices. In this paper, we propose singing beat tracking as a novel task, and propose the first approach to solving this task. Our approach leverages semantic information of singing voices by employing pre-trained self-supervised WavLM and DistilHuBERT speech representations as the front-end and uses a self-attention encoder layer to predict beats. To train and test the system, we obtain separated singing voices and their beat annotations using source separation and beat tracking on complete songs, followed by manual corrections. Experiments on the 741 separated vocal tracks of the GTZAN dataset show that the proposed system outperforms several state-of-the-art music beat tracking methods by a large margin in terms of beat tracking accuracy. Ablation studies also confirm the advantages of pre-trained self-supervised speech representations over generic spectral features.",
    "zenodo_id": 7316738,
    "dblp_key": null
  },
  {
    "title": "EnsembleSet: a new high quality synthesised dataset for chamber ensemble separation",
    "author": [
      "Saurjya Sarkar",
      "Emmanouil Benetos",
      "Mark Sandler"
    ],
    "year": "2022",
    "doi": "10.5281/zenodo.7316740",
    "url": "https://doi.org/10.5281/zenodo.7316740",
    "ee": "https://archives.ismir.net/ismir2022/paper/000075.pdf",
    "pages": "625-632",
    "abstract": "Music source separation research has made great advances in recent years, especially towards the problem of separating vocals, drums, and bass stems from mastered songs. The advances in this field can be directly attributed to the availability of large-scale multitrack research datasets for these mentioned stems. Tasks such as separating similar-sounding sources from an ensemble recording have seen limited research due to the lack of sizeable, bleed-free multitrack datasets. In this paper, we introduce a novel multitrack dataset called EnsembleSet generated using the Spitfire BBC Symphony Orchestra library using ensemble scores from RWC Classical Music Database and Mutopia. Our data generation method introduces automated articulation mapping for different playing styles based on the input MIDI/MusicXML data. The sample library also enables us to render the dataset with 20 different mix/microphone configurations allowing us to study various recording scenarios for each performance. The dataset presents 80 tracks (6+ hours) with a range of string, wind, and brass instruments arranged as chamber ensembles. We also present our benchmark on our synthesised dataset using a permutation-invariant time-domain separation model for chamber ensembles which produces generalisable results when tested on real recordings from existing datasets.",
    "zenodo_id": 7316740,
    "dblp_key": null
  },
  {
    "title": "End-to-End Lyrics Transcription Informed by Pitch and Onset Estimation",
    "author": [
      "Tengyu Deng",
      "Eita Nakamura",
      "Kazuyoshi Yoshii"
    ],
    "year": "2022",
    "doi": "10.5281/zenodo.7316742",
    "url": "https://doi.org/10.5281/zenodo.7316742",
    "ee": "https://archives.ismir.net/ismir2022/paper/000076.pdf",
    "pages": "633-639",
    "abstract": "This paper presents an automatic lyrics transcription (ALT) method for music recordings that leverages the framewise semitone-level sung pitches estimated in a multi-task learning framework. Compared to automatic speech recognition (ASR), ALT is challenging due to the insufficiency of training data and the variation and contamination of acoustic features caused by singing expressions and accompaniment sounds. The domain adaptation approach has thus recently been taken for updating an ASR model pre-trained from sufficient speech data. In the naive application of the end-to-end approach to ALT, the internal audio-to-lyrics alignment often fails due to the time-stretching nature of singing features. To stabilize the alignment, we make use of the semi-synchronous relationships between notes and characters. Specifically, a convolutional recurrent neural network (CRNN) is used for estimating the semitone-level pitches with note onset times while eliminating the intra- and inter-note pitch variations. This estimate helps an end-to-end ALT model based on connectionist temporal classification (CTC) learn correct audio-to-character alignment and mapping, where the ALT model is trained jointly with the pitch and onset estimation model. The experimental results show the usefulness of the pitch and onset information in ALT.",
    "zenodo_id": 7316742,
    "dblp_key": null
  },
  {
    "title": "Contrastive Audio-Language Learning for Music",
    "author": [
      "Ilaria Manco",
      "Emmanouil Benetos",
      "Elio Quinton",
      "George Fazekas"
    ],
    "year": "2022",
    "doi": "10.5281/zenodo.7316744",
    "url": "https://doi.org/10.5281/zenodo.7316744",
    "ee": "https://archives.ismir.net/ismir2022/paper/000077.pdf",
    "pages": "640-649",
    "abstract": "As one of the most intuitive interfaces known to humans, natural language has the potential to mediate many tasks that involve human-computer interaction, especially in application-focused fields like Music Information Retrieval. In this work, we explore cross-modal learning in an attempt to bridge audio and language in the music domain. To this end, we propose MusCALL, a framework for Music Contrastive Audio-Language Learning. Our approach consists of a dual-encoder architecture that learns the alignment between pairs of music audio and descriptive sentences, producing multimodal embeddings that can be used for text-to-audio and audio-to-text retrieval out-of-the-box. Thanks to this property, MusCALL can be transferred to virtually any task that can be cast as text-based retrieval. Our experiments show that our method performs significantly better than the baselines at retrieving audio that matches a textual description and, conversely, text that matches an audio query. We also demonstrate that the multimodal alignment capability of our model can be successfully extended to the zero-shot transfer scenario for genre classification and auto-tagging on two public datasets.",
    "zenodo_id": 7316744,
    "dblp_key": null
  },
  {
    "title": "MusAV: A dataset of relative arousal-valence annotations for validation of audio models",
    "author": [
      "Dmitry Bogdanov",
      "Xavier Lizarraga-Seijas",
      "Pablo Alonso-Jiménez",
      "Xavier Serra"
    ],
    "year": "2022",
    "doi": "10.5281/zenodo.7316746",
    "url": "https://doi.org/10.5281/zenodo.7316746",
    "ee": "https://archives.ismir.net/ismir2022/paper/000078.pdf",
    "pages": "650-658",
    "abstract": "We present MusAV, a new public benchmark dataset for comparative validation of arousal and valence (AV) regression models for audio-based music emotion recognition. To gather the ground truth, we rely on relative judgments instead of absolute values to simplify the manual annotation process and improve its consistency. We build MusAV by gathering comparative annotations of arousal and valence on pairs of tracks, using track audio previews and metadata from the Spotify API. The resulting dataset contains 2,092 track previews covering 1,404 genres, with pairwise relative AV judgments by 20 annotators and various subsets of the ground truth based on different levels of annotation agreement. We demonstrate the use of the dataset in an example study evaluating nine models for AV regression that we train based on state-of-the-art audio embeddings and three existing datasets of absolute AV annotations. The results on MusAV offer a view of the performance of the models complementary to the metrics obtained during training and provide insights into the impact of the considered datasets and embeddings on the generalization abilities of the models.",
    "zenodo_id": 7316746,
    "dblp_key": null
  },
  {
    "title": "What is missing in deep music generation? A study of repetition and structure in popular music",
    "author": [
      "Shuqi Dai",
      "Huiran Yu",
      "Roger B Dannenberg"
    ],
    "year": "2022",
    "doi": "10.5281/zenodo.7316748",
    "url": "https://doi.org/10.5281/zenodo.7316748",
    "ee": "https://archives.ismir.net/ismir2022/paper/000079.pdf",
    "pages": "659-666",
    "abstract": "Structure is one of the most essential aspects of music, and music structure is commonly indicated through repetition. However, the nature of repetition and structure in music is still not well understood, especially in the context of music generation, and much remains to be explored with Music Information Retrieval (MIR) techniques. Analyses of two popular music datasets (Chinese and American) illustrate important music construction principles: (1) structure exists at multiple hierarchical levels, (2) songs use repetition and limited vocabulary so that individual songs do not follow general statistics of song collections, (3) structure interacts with rhythm, melody, harmony, and predictability, and (4) over the course of a song, repetition is not random, but follows a general trend as revealed by cross-entropy. These and other findings offer challenges as well as opportunities for deep-learning music generation and suggest new formal music criteria and evaluation methods. Music from recent music generation systems is analyzed and compared to human-composed music in our datasets, often revealing striking differences from a structural perspective.",
    "zenodo_id": 7316748,
    "dblp_key": null
  },
  {
    "title": "Heterogeneous Graph Neural Network for Music Emotion Recognition",
    "author": [
      "Angelo Cesar Mendes Da Silva",
      "Diego F Silva",
      "Ricardo Marcondes Marcacini"
    ],
    "year": "2022",
    "doi": "10.5281/zenodo.7316750",
    "url": "https://doi.org/10.5281/zenodo.7316750",
    "ee": "https://archives.ismir.net/ismir2022/paper/000080.pdf",
    "pages": "667-674",
    "abstract": "Music emotion recognition has been a growing field of research motivated by the wealth of information that these labels express. Recognition of emotions highlights music's social and psychological functions, extending traditional applications such as style recognition or content similarity. Once musical data are intrinsically multi-modal, exploring this characteristic is usually beneficial. However, building a structure that incorporates different modalities in a unique space to represent the songs is challenging. Integrating information from related instances by learning heterogeneous graph-based representations has achieved state-of-the-art results in multiple tasks. This paper proposes structuring musical features over a heterogeneous network and learning a multi-modal representation using Graph Convolutional Networks with features extracted from audio and lyrics as inputs to handle the music emotion recognition tasks. We show that the proposed learning approach resulted in a representation with greater power to discriminate emotion labels. Moreover, our heterogeneous graph neural network classifier outperforms related works for music emotion recognition.",
    "zenodo_id": 7316750,
    "dblp_key": null
  },
  {
    "title": "And what if two musical versions don't share melody, harmony, rhythm, or lyrics ?",
    "author": [
      "Mathilde Abrassart",
      "Guillaume Doras"
    ],
    "year": "2022",
    "doi": "10.5281/zenodo.7316752",
    "url": "https://doi.org/10.5281/zenodo.7316752",
    "ee": "https://archives.ismir.net/ismir2022/paper/000081.pdf",
    "pages": "677-684",
    "abstract": "Version identification (VI) has seen substantial progress over the past few years. On the one hand, the introduction of the metric learning paradigm has favored the emergence of scalable yet accurate VI systems. On the other hand, using features focusing on specific aspects of musical pieces, such as melody, harmony, or lyrics, yielded interpretable and promising performances. In this work, we build upon these recent advances and propose a metric learning-based system systematically leveraging four dimensions commonly admitted to convey musical similarity between versions: melodic line, harmonic structure, rhythmic patterns, and lyrics. We describe our deliberately simple model architecture, and we show in particular that an approximated representation of the lyrics is an efficient proxy to discriminate between versions and non-versions. We then describe how these features complement each other and yield new state-of-the-art performances on two publicly available datasets. We finally suggest that a VI system using a combination of melodic, harmonic, rhythmic and lyrics features could theoretically reach the optimal performances obtainable on these datasets.",
    "zenodo_id": 7316752,
    "dblp_key": null
  },
  {
    "title": "A diffusion-inspired training strategy for singing voice extraction in the waveform domain",
    "author": [
      "Genís Plaja-Roglans",
      "Marius Miron",
      "Xavier Serra"
    ],
    "year": "2022",
    "doi": "10.5281/zenodo.7316754",
    "url": "https://doi.org/10.5281/zenodo.7316754",
    "ee": "https://archives.ismir.net/ismir2022/paper/000082.pdf",
    "pages": "685-693",
    "abstract": "Notable progress in music source separation has been achieved using multi-branch networks that operate on both temporal and spectral domains. However, such networks tend to be complex and heavy-weighted. In this work, we tackle the task of singing voice extraction from polyphonic music signals in an end-to-end manner using an approach inspired by the training procedure of denoising diffusion models. We perform unconditional signal modelling to gradually convert an input mixture signal to the corresponding singing voice or accompaniment. We use fewer parameters than the state-of-the-art models while operating on the waveform domain, bypassing phase-related problems. More concisely, we train a non-causal WaveNet using a diffusion-inspired strategy improving the said network for singing voice extraction and obtaining performance comparable to the end-to-end state-of-the-art on MUSDB18. We further report results on a non-MUSDB-overlapping version of MedleyDB and the multi-track audio of the Saraga Carnatic dataset showing good generalization, and run perceptual tests of our approach. Code, models, and audio examples are made available.",
    "zenodo_id": 7316754,
    "dblp_key": null
  },
  {
    "title": "A Model You Can Hear: Audio Identification with Playable Prototypes",
    "author": [
      "Romain Loiseau",
      "Baptiste Bouvier",
      "Yann Teytaut",
      "Elliot Vincent",
      "Mathieu Aubry",
      "Loic Landrieu"
    ],
    "year": "2022",
    "doi": "10.5281/zenodo.7316756",
    "url": "https://doi.org/10.5281/zenodo.7316756",
    "ee": "https://archives.ismir.net/ismir2022/paper/000083.pdf",
    "pages": "694-700",
    "abstract": "Machine learning techniques have proved useful for classifying and analyzing audio content. However, recent methods typically rely on abstract and high-dimensional representations that are difficult to interpret. Inspired by transformation-invariant approaches developed for image and 3D data, we propose an audio identification model based on learnable spectral prototypes. Equipped with dedicated transformation networks, these prototypes can be used to cluster and classify input audio samples from large collections of sounds. Our model can be trained with or without supervision and reaches state-of-the-art results for speaker and instrument identification, while remaining easily interpretable. The code is available at: https://github.com/romainloiseau/a-model-you-can-hear",
    "zenodo_id": 7316756,
    "dblp_key": null
  },
  {
    "title": "An Exploration of Generating Sheet Music Images",
    "author": [
      "Marcos Acosta",
      "Irmak Bukey",
      "T J Tsai"
    ],
    "year": "2022",
    "doi": "10.5281/zenodo.7316758",
    "url": "https://doi.org/10.5281/zenodo.7316758",
    "ee": "https://archives.ismir.net/ismir2022/paper/000084.pdf",
    "pages": "701-708",
    "abstract": "Many previous works in recent years have explored various forms of music generation. These works have focused on generating either raw audio waveforms or symbolic music. In this work, we explore the feasibility of generating sheet music images, which is often the primary form in which musical compositions are notated for other musicians. Using the PrIMuS dataset as a testbed, we explore five different sequence-based approaches for generating lines of sheet music: generating sequences of (a) pixel columns, (b) image patches, (c) visual word tokens, (d) semantic tokens, and (e) XML-based tags. We show sample generated images, discuss the practical challenges and problems with each approach, and give our recommendation on the most promising paths to explore in the future.",
    "zenodo_id": 7316758,
    "dblp_key": null
  },
  {
    "title": "HPPNet: Modeling the Harmonic Structure and Pitch Invariance in Piano Transcription",
    "author": [
      "Weixing Wei",
      "Peilin Li",
      "Yi Yu",
      "Wei Li"
    ],
    "year": "2022",
    "doi": "10.5281/zenodo.7316762",
    "url": "https://doi.org/10.5281/zenodo.7316762",
    "ee": "https://archives.ismir.net/ismir2022/paper/000085.pdf",
    "pages": "709-716",
    "abstract": "While neural network models are making significant progress in piano transcription, they are becoming more resource-consuming due to requiring larger model size and more computing power. In this paper, we attempt to apply more prior about piano to reduce model size and improve the transcription performance. The sound of a piano note contains various overtones, and the pitch of a key does not change over time. To make full use of such latent information, we propose HPPNet that using the Harmonic Dilated Convolution to capture the harmonic structures and the Frequency Grouped Recurrent Neural Network to model the pitch-invariance over time. Experimental results on the MAESTRO dataset show that our piano transcription system achieves state-of-the-art performance both in frame and note scores (frame F1 93.15%, note F1 97.18%). Moreover, the model size is much smaller than the previous state-of-the-art deep learning models.",
    "zenodo_id": 7316762,
    "dblp_key": null
  },
  {
    "title": "Generating music with sentiment using Transformer-GANs",
    "author": [
      "Pedro L T Neves",
      "José Fornari",
      "João B Florindo"
    ],
    "year": "2022",
    "doi": "10.5281/zenodo.7316764",
    "url": "https://doi.org/10.5281/zenodo.7316764",
    "ee": "https://archives.ismir.net/ismir2022/paper/000086.pdf",
    "pages": "717-725",
    "abstract": "The field of Automatic Music Generation has seen significant progress thanks to the advent of Deep Learning. However, most of these results have been produced by unconditional models, which lack the ability to interact with their users, not allowing them to guide the generative process in meaningful and practical ways. Moreover, synthesizing music that remains coherent across longer timescales while still capturing the local aspects that make it sound ``realistic'' or human-like is still challenging. This is due to the large computational requirements needed to work with long sequences of data, and also to limitations imposed by the training schemes that are often employed. In this paper, we propose a generative model of symbolic music conditioned by data retrieved from human sentiment. The model is a Transformer-GAN trained with labels that correspond to different configurations of the valence and arousal dimensions that quantitatively represent human affective states. We try to tackle both of the problems above by employing an efficient linear version of Attention and using a Discriminator both as a tool to improve the overall quality of the generated music and its ability to follow the conditioning signals.",
    "zenodo_id": 7316764,
    "dblp_key": null
  },
  {
    "title": "Improving Choral Music Separation through Expressive Synthesized Data from Sampled Instruments",
    "author": [
      "Ke Chen",
      "Hao-Wen Dong",
      "Yi Luo",
      "Julian Mcauley",
      "Taylor Berg-Kirkpatrick",
      "Miller Puckette",
      "Shlomo Dubnov"
    ],
    "year": "2022",
    "doi": "10.5281/zenodo.7316766",
    "url": "https://doi.org/10.5281/zenodo.7316766",
    "ee": "https://archives.ismir.net/ismir2022/paper/000087.pdf",
    "pages": "726-732",
    "abstract": "Choral music separation refers to the task of extracting tracks of voice parts (e.g., soprano, alto, tenor, and bass) from mixed audio. The lack of datasets has impeded research on this topic as previous work has only been able to train and evaluate models on a few minutes of choral music data due to copyright issues and dataset collection difficulties. In this paper, we investigate the use of synthesized training data for the source separation task on real choral music. We make three contributions: first, we provide an automated pipeline for synthesizing choral music data from sampled instrument plugins within controllable options for instrument expressiveness. This produces an 8.2-hour-long choral music dataset from the JSB Chorales Dataset and one can easily synthesize additional data. Second, we conduct an experiment to evaluate multiple separation models on available choral music separation datasets from previous work. To the best of our knowledge, this is the first experiment to comprehensively evaluate choral music separation. Third, experiments demonstrate that the synthesized choral data is of sufficient quality to improve the model's performance on real choral music datasets. This provides additional experimental statistics and data support for the choral music separation study.",
    "zenodo_id": 7316766,
    "dblp_key": null
  },
  {
    "title": "Ethics of Singing Voice Synthesis: Perceptions of Users and Developers",
    "author": [
      "Kyungyun Lee",
      "Gladys Hitt",
      "Emily Terada",
      "Jin Ha Lee"
    ],
    "year": "2022",
    "doi": "10.5281/zenodo.7316768",
    "url": "https://doi.org/10.5281/zenodo.7316768",
    "ee": "https://archives.ismir.net/ismir2022/paper/000088.pdf",
    "pages": "733-740",
    "abstract": "Singing Voice Synthesis (SVS) has recently garnered much attention as its quality has improved vastly with the use of artificial intelligence (AI), creating many opportunities for supporting music creators and listeners. Recently, there have been growing concerns about ethical issues related to AI development in general, and to AI-based SVS development specifically. Many questions remain unexplored about how to ethically develop and use such technology. In this paper, we investigate the perception of ethical issues related to SVS from the perspectives of two different groups: the general public and developers. We collected 3,075 user comments from YouTube videos showcasing various uses of SVS as part of a mainstream variety show. Additionally, we interviewed six researchers developing SVS technology. Through thematic analysis, we identify and discuss three different aspects related to ethical issues in SVS development, highlighting the similarities and differences between the perspectives of the general public and developers: (1) Use scenarios, (2) Attitudes towards development, and (3) Meaning of Creativity, and (4) Concerns about human rights, intellectual property (IP) and legal issues.",
    "zenodo_id": 7316768,
    "dblp_key": null
  },
  {
    "title": "Emotion-driven Harmonisation And Tempo Arrangement of Melodies Using Transfer Learning",
    "author": [
      "Takuya Takahashi",
      "Mathieu Barthet"
    ],
    "year": "2022",
    "doi": "10.5281/zenodo.7316770",
    "url": "https://doi.org/10.5281/zenodo.7316770",
    "ee": "https://archives.ismir.net/ismir2022/paper/000089.pdf",
    "pages": "741-748",
    "abstract": "We propose and assess deep learning models for harmonic and tempo arrangement generation given melodies and emotional constraints. A dataset of 4000 symbolic scores and emotion labels was gathered by expanding the HTPD3 dataset with mood tags from last.fm and allmusic.com. We explore how bi-directional LSTM and Transformer encoder architectures can learn relationships between symbolic melodies, chord progressions, tempo, and expressed emotions, with and without a transfer learning strategy leveraging symbolic music data without emotion labels. Three emotion annotation summarisation methods based on the Arousal/Valence (AV) representation are compared: Emotion Average, Emotion Surface, and Emotion Category. 20 participants (average age: 30.2, 7 females and 13 males from Japan) rated how well generated accompaniments matched melodies (musical coherence) as well as perceived emotions for 75 arrangements corresponding to combinations of models and emotion summarisation methods. Musical coherence and match between target and perceived emotions were highest when melodies were encoded using a BLSTM model with transfer learning. The proposed method generates emotion-driven harmonic/tempo arrangements in a fast way, a keen advantage compared to state of the art. Applications of this work include AI-based composition assistant and live interactive music systems for entertainment such as video games.",
    "zenodo_id": 7316770,
    "dblp_key": null
  },
  {
    "title": "Using Activation Functions for Improving Measure-Level Audio Synchronization",
    "author": [
      "Yigitcan Özer",
      "Matej Ištvánek",
      "Vlora Arifi-Müller",
      "Meinard Müller"
    ],
    "year": "2022",
    "doi": "10.5281/zenodo.7342932",
    "url": "https://doi.org/10.5281/zenodo.7342932",
    "ee": "https://archives.ismir.net/ismir2022/paper/000090.pdf",
    "pages": "749-755",
    "abstract": "Audio synchronization aims at aligning multiple recordings of the same piece of music. Traditional synchronization approaches are often based on dynamic time warping using chroma features as an input representation. Previous work has shown how one can integrate onset cues into this pipeline for improving the alignment's temporal accuracy. Furthermore, recent work based on deep neural networks has led to significant improvements for learning onset, beat, and downbeat activation functions. However, for music with soft onsets and abrupt tempo changes, these functions may be unreliable, leading to unstable results. As the main contribution of this paper, we introduce a combined approach that integrates activation functions into the synchronization pipeline. We show that this approach improves the temporal accuracy thanks to the activation cues while inheriting the robustness of the traditional synchronization approach. Conducting experiments based on string quartet recordings, we evaluate our combined approach where we transfer measure annotations from a reference recording to a target recording.",
    "zenodo_id": 7342932,
    "dblp_key": null
  },
  {
    "title": "A deep learning method for melody extraction from a polyphonic symbolic music representation",
    "author": [
      "Katerina Kosta",
      "Wei Tsung Lu",
      "Gabriele Medeot",
      "Pierre Chanquion"
    ],
    "year": "2022",
    "doi": "10.5281/zenodo.7402960",
    "url": "https://doi.org/10.5281/zenodo.7402960",
    "ee": "https://archives.ismir.net/ismir2022/paper/000091.pdf",
    "pages": "756-763",
    "abstract": "The task of identifying melodic lines in a polyphonic piece is a known active research topic in the symbolic and audio domain. Its importance has attracted the interest of researchers focusing on Music Information Retrieval and musicological applications and achieving high results is a common goal in industrial applications. The distinction of a melody in a written score can be a challenging task, however improvements have been reported in recent years using deep learning methods. In this paper, we present a lightweight deep bidirectional LSTM model for identifying the most salient melodic line of a music piece using handcrafted features without requiring the input score to be separated into multiple parts. We evaluate our model to measure the effectiveness of several data augmentation techniques and to compare performance to other state-of-the-art models. We also identify the features importance and evaluate their incremental contribution on the model performance using evaluation metrics. Results on the POP909 dataset show that our model approximates or outperforms current state of the art models trained on the same dataset, based on different implemented metrics and observations.",
    "zenodo_id": 7402960,
    "dblp_key": null
  },
  {
    "title": "A Reproducibility Study on User-centric MIR Research and Why it is Important",
    "author": [
      "Peter Knees",
      "Bruce Ferwerda",
      "Andreas Rauber",
      "Sebastian Strumbelj",
      "Annabel Resch",
      "Laurenz Tomandl",
      "Valentin Bauer",
      "Fung Yee Tang",
      "Josip Bobinac",
      "Amila Ceranic",
      "Riad Dizdar"
    ],
    "year": "2022",
    "doi": "10.5281/zenodo.7316776",
    "url": "https://doi.org/10.5281/zenodo.7316776",
    "ee": "https://archives.ismir.net/ismir2022/paper/000092.pdf",
    "pages": "764-771",
    "abstract": "Reproducibility of results is a central pillar of scientific work. In music information retrieval research, this is widely acknowledged and practiced by the community by re-implementing algorithms and re-validating machine learning experiments. In this paper, we argue for an increased need to also reproduce the results and findings of user studies, including qualitative work, especially since these often lay the foundations and serve as justification for choices taken in algorithmic design and optimization criteria. As an example, we attempt to reproduce the study by Kim et al. presented in the RecSys (2020) paper ''Do Channels Matter? Illuminating Interpersonal Influence on Music Recommendations.'' By repeating this study on how interpersonal relationships can affect a user's assessment of music recommendations on a new sample of n=142 participants, we can largely confirm and support the validity of the original results. At the same time, we extend the analysis and also observe differences with regards to adoption rates between different channels as well as different factors that influences the adoption rate. From this specific reproducibility study, we conclude that potential cultural differences should be accounted for more explicitly in future studies and that systems development should be more explicitly connected to its intended target audience.",
    "zenodo_id": 7316776,
    "dblp_key": null
  },
  {
    "title": "Music Separation Enhancement with Generative Modeling",
    "author": [
      "Noah Schaffer",
      "Boaz Cogan",
      "Ethan Manilow",
      "Max Morrison",
      "Prem Seetharaman",
      "Bryan Pardo"
    ],
    "year": "2022",
    "doi": "10.5281/zenodo.7316778",
    "url": "https://doi.org/10.5281/zenodo.7316778",
    "ee": "https://archives.ismir.net/ismir2022/paper/000093.pdf",
    "pages": "772-780",
    "abstract": "Despite phenomenal progress in recent years, state-of-the-art music separation systems produce source estimates with significant perceptual shortcomings, such as adding extraneous noise or removing harmonics. We propose a post-processing model (the Make it Sound Good (MSG) post-processor) to enhance the output of music source separation systems. We apply our post-processing model to state-of-the-art waveform-based and spectrogram-based music source separators, including a separator unseen by MSG during training. Our analysis of the errors produced by source separators shows that waveform models tend to introduce more high-frequency noise, while spectrogram models tend to lose transients and high frequency content. We introduce objective measures to quantify both kinds of errors and show MSG improves the source reconstruction of both kinds of errors. Crowdsourced subjective evaluations demonstrate that human listeners prefer source estimates of bass and drums that have been post-processed by MSG.",
    "zenodo_id": 7316778,
    "dblp_key": null
  },
  {
    "title": "SampleMatch: Drum Sample Retrieval by Musical Context",
    "author": [
      "Stefan Lattner"
    ],
    "year": "2022",
    "doi": "10.5281/zenodo.7316780",
    "url": "https://doi.org/10.5281/zenodo.7316780",
    "ee": "https://archives.ismir.net/ismir2022/paper/000094.pdf",
    "pages": "781-788",
    "abstract": "Modern digital music production typically involves combining numerous acoustic elements to compile a piece of music. Important types of such elements are drum samples, which determine the characteristics of the percussive components of the piece. Artists must use their aesthetic judgement to assess whether a given drum sample fits the current musical context. However, selecting drum samples from a potentially large library is tedious and may interrupt the creative flow. In this work, we explore the automatic drum sample retrieval based on aesthetic principles learned from data. As a result, artists can rank the samples in their library by fit to some musical context at different stages of the production process (i.e., by fit to incomplete song mixtures). To this end, we use contrastive learning to maximize the score of drum samples originating from the same song as the mixture. We conduct a listening test to determine whether the human ratings match the automatic scoring function. We also perform objective quantitative analyses to evaluate the efficacy of our approach.",
    "zenodo_id": 7316780,
    "dblp_key": null
  },
  {
    "title": "A Transformer-Based \"Spellchecker\" for Detecting Errors in OMR Output",
    "author": [
      "Timothy De Reuse",
      "Ichiro Fujinaga"
    ],
    "year": "2022",
    "doi": "10.5281/zenodo.7316782",
    "url": "https://doi.org/10.5281/zenodo.7316782",
    "ee": "https://archives.ismir.net/ismir2022/paper/000095.pdf",
    "pages": "789-796",
    "abstract": "The outputs of Optical Music Recognition (OMR) systems require time-consuming human correction. Given that most of the errors induced by OMR processes appear non-musical to humans, we propose that the time to correct errors may be reduced by marking all symbols on a score that are musically unlikely, allowing the human to focus their attention accordingly. Using a dataset of Romantic string quartets, we train a variant of the Transformer network architecture on the task of classifying each symbol of an optically-recognized musical piece in symbolic format as correct or erroneous, based on whether a manual correction of the piece would require an insertion, deletion, or replacement of a symbol at that location. Since we have a limited amount of data with real OMR errors, we employ extensive data augmentation to add errors into training data in a way that mimics how OMR would modify the score. Our best-performing models achieve 99% recall and 50% precision on this error-detection task.",
    "zenodo_id": 7316782,
    "dblp_key": null
  },
  {
    "title": "\"More than words\": Linking Music Preferences and Moral Values through Lyrics",
    "author": [
      "Vjosa Preniqi",
      "Kyriaki Kalimeri",
      "Charalampos Saitis"
    ],
    "year": "2022",
    "doi": "10.5281/zenodo.7343071",
    "url": "https://doi.org/10.5281/zenodo.7343071",
    "ee": "https://archives.ismir.net/ismir2022/paper/000096.pdf",
    "pages": "797-805",
    "abstract": "This study explores the association between music preferences and moral values by applying text analysis techniques to lyrics. Harvesting data from a Facebook-hosted application, we align psychometric scores of 1,386 users to lyrics from the top 5 songs of their preferred music artists as emerged from Facebook Page Likes. We extract a set of lyrical features related to each song’s overarching narrative, moral valence, sentiment, and emotion. A machine learning framework was designed to exploit regression ap- proaches and evaluate the predictive power of lyrical features for inferring moral values. Results suggest that lyrics from top songs of artists people like inform their morality. Virtues of hierarchy and tradition achieve higher prediction scores (.20 ≤ r ≤ .30) than values of empathy and equality (.08 ≤ r ≤ .11), while basic demographic variables only account for a small part in the models’ explainability. This shows the importance of music listening behaviours, as assessed via lyrical preferences, alone in capturing moral values. We discuss the technological and musicological implications and possible future improvements.",
    "zenodo_id": 7343071,
    "dblp_key": null
  },
  {
    "title": "A unified model for zero-shot singing voice conversion and synthesis",
    "author": [
      "Jui-Te Wu",
      "Jun-You Wang",
      "Jyh-Shing Roger Jang",
      "Li Su"
    ],
    "year": "2022",
    "doi": "10.5281/zenodo.7316786",
    "url": "https://doi.org/10.5281/zenodo.7316786",
    "ee": "https://archives.ismir.net/ismir2022/paper/000097.pdf",
    "pages": "809-816",
    "abstract": "Recent advances in deep learning not only facilitate the implementation of zero-shot singing voice synthesis (SVS) and singing voice conversion (SVC) tasks but also provide the opportunity to unify these two tasks into one generalized model. In this paper, we propose such a model that generate the singing voice of any target singer from any source singing content in either text or audio format. The model incorporates self-supervised joint training of the phonetic encoder and the acoustic encoder, with an audio-to-phoneme alignment process in each training step, such that these encoders map the audio and text data respectively into a shared, temporally aligned, and singer agnostic latent space. The target singer’s latent representations encoded at different granularity levels are all trained to match the source latent representations sequentially with the attention mechanisms in the decoding stage. This enables the model to generate unseen target singer’s voice with fine-grained resolution from either text or audio sources. Both objective and subjective experiments confirmed that the proposed model is competitive with the state-of-the-art SVC and SVS methods.",
    "zenodo_id": 7316786,
    "dblp_key": null
  },
  {
    "title": "Semantic Control of Generative Musical Attributes",
    "author": [
      "Stewart Greenhill",
      "Majid Abdolshah",
      "Vuong Le",
      "Sunil Gupta",
      "Svetha Venkatesh"
    ],
    "year": "2022",
    "doi": "10.5281/zenodo.7316788",
    "url": "https://doi.org/10.5281/zenodo.7316788",
    "ee": "https://archives.ismir.net/ismir2022/paper/000098.pdf",
    "pages": "817-824",
    "abstract": "Deep generative neural networks have been successful in tasks such as composing novel music and rendering expressive performance. Controllability is essential for building creative tools from such models. Recent work in this area has focused on disentangled latent space representations, but this is only part of the solution. Efficient control of semantic attributes must handle non-linearities and holes that occur in latent spaces, whilst minimising unwanted changes to other attributes. This paper introduces SeNT-Gen, a neural traversal algorithm that uses a secondary neural network to model the complex relationships between latent codes and musical attributes. This enables precise editing of semantic attributes that adapts to context. We demonstrate the method using the dMelodies dataset, and show strong performance for several VAE models.",
    "zenodo_id": 7316788,
    "dblp_key": null
  },
  {
    "title": "Music Representation Learning Based on Editorial Metadata from Discogs",
    "author": [
      "Pablo Alonso-Jiménez",
      "Xavier Serra",
      "Dmitry Bogdanov"
    ],
    "year": "2022",
    "doi": "10.5281/zenodo.7316790",
    "url": "https://doi.org/10.5281/zenodo.7316790",
    "ee": "https://archives.ismir.net/ismir2022/paper/000099.pdf",
    "pages": "825-833",
    "abstract": "This paper revisits the idea of music representation learning supervised by editorial metadata, contributing to the state of the art in two ways. First, we exploit the public editorial metadata available on Discogs, an extensive community-maintained music database containing information about artists, releases, and record labels. Second, we use a contrastive learning setup based on COLA, different from previous systems based on triplet loss. We train models targeting several associations derived from the metadata and experiment with stacked combinations of learned representations, evaluating them on standard music classification tasks. Additionally, we consider learning all the associations jointly in a multi-task setup. We show that it is possible to improve the performance of current self-supervised models by using inexpensive metadata commonly available in music collections, producing representations comparable to those learned on classification setups. We find that the resulting representations based on editorial metadata outperform a system trained with music style tags available in the same large-scale dataset, which motivates further research using this type of supervision. Additionally, we give insights on how to preprocess Discogs metadata to build training objectives and provide public pre-trained models.",
    "zenodo_id": 7316790,
    "dblp_key": null
  },
  {
    "title": "Melody Infilling with User-Provided Structural Context",
    "author": [
      "Chih-Pin Tan",
      "Alvin W Y Su",
      "Yi-Hsuan Yang"
    ],
    "year": "2022",
    "doi": "10.5281/zenodo.7316792",
    "url": "https://doi.org/10.5281/zenodo.7316792",
    "ee": "https://archives.ismir.net/ismir2022/paper/000100.pdf",
    "pages": "834-841",
    "abstract": "This paper proposes a novel Transformer-based model for music score infilling, to generate a music passage that fills in the gap between given past and future contexts. While existing infilling approaches can generate a passage that connects smoothly locally with the given contexts, they do not take into account the musical form or structure of the music and may therefore generate overly smooth results. To address this issue, we propose a structure-aware conditioning approach that employs a novel attention-selecting module to supply user-provided structure-related information to the Transformer for infilling. With both objective and subjective evaluations, we show that the proposed model can harness the structural information effectively and generate melodies in the style of pop of higher quality than the two existing structure-agnostic infilling models.",
    "zenodo_id": 7316792,
    "dblp_key": null
  },
  {
    "title": "Robust Melody Track Identification in Symbolic Music",
    "author": [
      "Xichu Ma",
      "Xiao Liu",
      "Bowen Zhang",
      "Ye Wang"
    ],
    "year": "2022",
    "doi": "10.5281/zenodo.7342531",
    "url": "https://doi.org/10.5281/zenodo.7342531",
    "ee": "https://archives.ismir.net/ismir2022/paper/000101.pdf",
    "pages": "842-849",
    "abstract": "Melody tracks are worthy of special attention in the field of symbolic music information retrieval (MIR) because they contribute more towards music perception than many other musical components. However, many existing symbolic MIR systems neglect melody track identification (MTI) and are thus less effective. Existing MTI methods are also not robust and perform poorly on MIDI files representing music of unusual genres, arrangements, or formats. To address this problem, we propose a CNN-Transformer-based MTI model designed to robustly identify a single melody track for a given MIDI file. As this process can take a sizable amount of time for long songs, we also use a sparse Transformer to speed up attention computation. Our experiments show that our proposed model outperforms state-of-the-art (SOTA) algorithms in accuracy and can also benefit downstream MIR tasks.",
    "zenodo_id": 7342531,
    "dblp_key": null
  },
  {
    "title": "Tracking the Evolution of a Band's Live Performances over Decades",
    "author": [
      "Florian Thalmann",
      "Eita Nakamura",
      "Kazuyoshi Yoshii"
    ],
    "year": "2022",
    "doi": "10.5281/zenodo.7342596",
    "url": "https://doi.org/10.5281/zenodo.7342596",
    "ee": "https://archives.ismir.net/ismir2022/paper/000102.pdf",
    "pages": "850-857",
    "abstract": "Evolutionary studies have become a dominant thread in the analysis of large audio collections. Such corpora usually consist of musical pieces by various composers or bands and the studies usually focus on identifying general historical trends in harmonic content or music production techniques. In this paper we present a comparable study that examines the music of a single band whose publicly available live recordings span three decades. We first discuss the opportunities and challenges faced when working with single-artist and live-music datasets and introduce solutions for audio feature validation and outlier detection. We then investigate how individual songs vary over time and identify general performance trends using a new approach based on relative feature values, which improves accuracy for features with a large variance. Finally, we validate our findings by juxtaposing them with descriptions posted in online forums by experienced listeners of the band's large following.",
    "zenodo_id": 7342596,
    "dblp_key": null
  },
  {
    "title": "Evaluating Generative Audio Systems and Their Metrics",
    "author": [
      "Ashvala Vinay",
      "Alexander Lerch"
    ],
    "year": "2022",
    "doi": "10.5281/zenodo.7343083",
    "url": "https://doi.org/10.5281/zenodo.7343083",
    "ee": "https://archives.ismir.net/ismir2022/paper/000103.pdf",
    "pages": "858-865",
    "abstract": "Recent years have seen considerable advances in audio synthesis with deep generative models. However, the state-of-the-art is very difficult to quantify; different studies often use different evaluation methodologies and different metrics when reporting results, making a direct comparison to other systems difficult if not impossible. Furthermore, the perceptual relevance and meaning of the reported metrics in most cases unknown, prohibiting any conclusive insights with respect to practical usability and audio quality. This paper presents a study that investigates state-of-the-art approaches side-by-side with (i) a set of previously proposed objective metrics for audio reconstruction, and with (ii) a listening study. The results indicate that currently used objective metrics are insufficient to describe the perceptual quality of current systems.",
    "zenodo_id": 7343083,
    "dblp_key": null
  },
  {
    "title": "Representation Learning for the Automatic Indexing of Sound Effects Libraries",
    "author": [
      "Alison B Ma",
      "Alexander Lerch"
    ],
    "year": "2022",
    "doi": "10.5281/zenodo.7316800",
    "url": "https://doi.org/10.5281/zenodo.7316800",
    "ee": "https://archives.ismir.net/ismir2022/paper/000104.pdf",
    "pages": "866-875",
    "abstract": "Labeling and maintaining a commercial sound effects library is a time-consuming task exacerbated by databases that continually grow in size and undergo taxonomy updates. Moreover, sound search and taxonomy creation are complicated by non-uniform metadata, an unrelenting problem even with the introduction of a new industry standard, the Universal Category System. To address these problems and overcome dataset-dependent limitations that inhibit the successful training of deep learning models, we pursue representation learning to train generalized embeddings that can be used for a wide variety of sound effects libraries and are a taxonomy-agnostic representation of sound. We show that a task-specific but dataset-independent representation can successfully address data issues such as class imbalance, inconsistent class labels, and insufficient dataset size, outperforming established representations such as OpenL3. Detailed experimental results show the impact of metric learning approaches and different cross-dataset training methods on representational effectiveness.",
    "zenodo_id": 7316800,
    "dblp_key": null
  },
  {
    "title": "Concept-Based Techniques for \"Musicologist-Friendly\" Explanations in Deep Music Classifiers",
    "author": [
      "Francesco Foscarin",
      "Katharina Hoedt",
      "Verena Praher",
      "Arthur Flexer",
      "Gerhard Widmer"
    ],
    "year": "2022",
    "doi": "10.5281/zenodo.7316804",
    "url": "https://doi.org/10.5281/zenodo.7316804",
    "ee": "https://archives.ismir.net/ismir2022/paper/000105.pdf",
    "pages": "876-883",
    "abstract": "Current approaches for explaining deep learning systems applied to musical data provide results in a low-level feature space, e.g., by highlighting potentially relevant time-frequency bins in a spectrogram or time-pitch bins in a piano roll. This can be difficult to understand, particularly for musicologists without technical knowledge. To address this issue, we focus on more human-friendly explanations based on high-level musical concepts. Our research targets trained systems (post-hoc explanations) and explores two approaches: a supervised one, where the user can define a musical concept and test if it is relevant to the system; and an unsupervised one, where musical excerpts containing relevant concepts are automatically selected and given to the user for interpretation. We demonstrate both techniques on an existing symbolic composer classification system, showcase their potential, and highlight their intrinsic limitations.",
    "zenodo_id": 7316804,
    "dblp_key": null
  },
  {
    "title": "Verse versus Chorus: Structure-aware Feature Extraction for Lyrics-based Genre Recognition",
    "author": [
      "Maximilian Mayerl",
      "Stefan Brandl",
      "Günther Specht",
      "Markus Schedl",
      "Eva Zangerle"
    ],
    "year": "2022",
    "doi": "10.5281/zenodo.7316806",
    "url": "https://doi.org/10.5281/zenodo.7316806",
    "ee": "https://archives.ismir.net/ismir2022/paper/000106.pdf",
    "pages": "884-890",
    "abstract": "The aim of lyrics-based genre recognition is to automatically determine the genre of a given song based on its lyrics. Previous approaches for this task have commonly used textual features extracted from the entirety of a song's lyrics, neglecting the inherent structure of lyrics consisting of, for instance, verses and choruses. Therefore, we pose the hypothesis that features extracted from different parts of the lyrics can have significantly different predictive power. To test this hypothesis, we perform a series of experiments to determine whether models trained on features taken from verses and choruses perform differently for genre recognition. Our experiments indeed confirm our hypothesis, showing that generally, using features extracted from verses leads to higher performance than features extracted from choruses. Digging deeper, we found that this is especially true for pop and rap songs. Rock songs show the opposite effect, with features extracted from choruses performing better than those taken from verses.",
    "zenodo_id": 7316806,
    "dblp_key": null
  },
  {
    "title": "Transfer Learning of wav2vec 2.0 for Automatic Lyric Transcription",
    "author": [
      "Longshen Ou",
      "Xiangming Gu",
      "Ye Wang"
    ],
    "year": "2022",
    "doi": "10.5281/zenodo.7342796",
    "url": "https://doi.org/10.5281/zenodo.7342796",
    "ee": "https://archives.ismir.net/ismir2022/paper/000107.pdf",
    "pages": "891-899",
    "abstract": "Automatic speech recognition (ASR) has progressed significantly in recent years due to the emergence of large-scale datasets and the self-supervised learning (SSL) paradigm. However, as its counterpart problem in the singing domain, the development of automatic lyric transcription (ALT) suffers from limited data and degraded intelligibility of sung lyrics. To fill in the performance gap between ALT and ASR, we attempt to exploit the similarities between speech and singing. In this work, we propose a transfer-learning-based ALT solution that takes advantage of these similarities by adapting wav2vec 2.0, an SSL ASR model, to the singing domain. We maximize the effectiveness of transfer learning by exploring the influence of different transfer starting points. We further enhance the performance by extending the original CTC model to a hybrid CTC/attention model. Our method surpasses previous approaches by a large margin on various ALT benchmark datasets. Further experiments show that, with even a tiny proportion of training data, our method still achieves competitive performance.",
    "zenodo_id": 7342796,
    "dblp_key": null
  },
  {
    "title": "A Novel Dataset and Deep Learning Benchmark for Classical Music Form Recognition and Analysis",
    "author": [
      "Daniel Szelogowski",
      "Lopamudra Mukherjee",
      "Benjamin Whitcomb"
    ],
    "year": "2022",
    "doi": "10.5281/zenodo.7316810",
    "url": "https://doi.org/10.5281/zenodo.7316810",
    "ee": "https://archives.ismir.net/ismir2022/paper/000108.pdf",
    "pages": "900-907",
    "abstract": "Automated computational analysis schemes for Western classical music analysis based on form and hierarchical structure have not received much attention in the literature so far. One reason, of course, is the paucity of labeled datasets — which, if available, could be used to train machine learning approaches. Dataset curation cannot be crowdsourced; one needs trained musicians to devote sizable effort to carry out such annotations. Further, such an analysis is not simple for beginners; obtaining labeled data that can capture the nuances of a musician's reasoning acquired over years of practice is fraught with challenges. To this end, we provide a system for computational analysis of classical music, both for machine learning and music researchers. First, we introduce a labeled dataset containing 200 classical music pieces annotated by form and phrases. Then, by leveraging this dataset, we show that deep learning-based methods can be used to learn Form Classification as well as Phrase Analysis and Classification, for which few (if any) results have been reported yet. Taken together, we provide the community with a unique dataset as well as a toolkit needed to analyze classical music structure, which can be used or extended to drive applications in both commercial and educational settings.",
    "zenodo_id": 7316810,
    "dblp_key": null
  },
  {
    "title": "BAF: An audio fingerprinting dataset for broadcast monitoring",
    "author": [
      "Guillem Cortès",
      "Alex Ciurana",
      "Emilio Molina",
      "Marius Miron",
      "Owen Meyers",
      "Joren Six",
      "Xavier Serra"
    ],
    "year": "2022",
    "doi": "10.5281/zenodo.7372162",
    "url": "https://doi.org/10.5281/zenodo.7372162",
    "ee": "https://archives.ismir.net/ismir2022/paper/000109.pdf",
    "pages": "908-916",
    "abstract": "Audio Fingerprinting (AFP) is a well-studied problem in music information retrieval for various use-cases e.g. content-based copy detection, DJ-set monitoring, and music excerpt identification. However, AFP for continuous broadcast monitoring (e.g. for TV & Radio), where music is often in the background, has not received much attention despite its importance to the music industry. In this paper (1) we present BAF, the first public dataset for music monitoring in broadcast. It contains 74 hours of production music from Epidemic Sound and 57 hours of TV audio recordings. Furthermore, BAF provides cross-annotations with exact matching timestamps between Epidemic tracks and TV recordings. Approximately, 80% of the total annotated time is background music. (2) We benchmark BAF with public state-of-the-art AFP systems, together with our proposed baseline PeakFP: a simple, non-scalable AFP algorithm based on spectral peak matching. In this benchmark, none of the algorithms obtain a F1-score above 47%, pointing out that further research is needed to reach the AFP performance levels in other studied use cases. The dataset, baseline, and benchmark framework are open and available for research.",
    "zenodo_id": 7372162,
    "dblp_key": null
  },
  {
    "title": "Cadence Detection in Symbolic Classical Music using Graph Neural Networks.",
    "author": [
      "Emmanouil Karystinaios",
      "Gerhard Widmer"
    ],
    "year": "2022",
    "doi": "10.5281/zenodo.7316814",
    "url": "https://doi.org/10.5281/zenodo.7316814",
    "ee": "https://archives.ismir.net/ismir2022/paper/000110.pdf",
    "pages": "917-924",
    "abstract": "Cadences are complex structures that have been driving music from the beginning of contrapuntal polyphony until today. Detecting such structures is vital for numerous MIR tasks such as musicological analysis, key detection, music segmentation, and others. However, automatic cadence detection remains a challenging task mainly because it involves a combination of high-level musical elements like harmony, voice leading, and rhythm. In this work, we present a graph representation of symbolic scores as an intermediate means to solve the cadence detection task. We approach cadence detection as an imbalanced node classification problem using a Graph Convolutional Network. We obtain results that are at least on par with the state of the art, and we present a model capable of making predictions at multiple levels of granularity, from individual notes to beats, thanks to the fine-grained, note-by-note representation. Moreover, our experiments suggest that graph convolution is able to learn non-local features that assist in cadence detection, freeing us from the need of having to devise specialized features that encode non-local context. We argue that this general approach to modeling musical scores and classification tasks has a number of potential advantages, beyond the specific recognition task presented here.",
    "zenodo_id": 7316814,
    "dblp_key": null
  },
  {
    "title": "Domain Adversarial Training on Conditional Variational Auto-Encoder for Controllable Music Generation",
    "author": [
      "Jingwei Zhao",
      "Gus Xia",
      "Ye Wang"
    ],
    "year": "2022",
    "doi": "10.5281/zenodo.7316816",
    "url": "https://doi.org/10.5281/zenodo.7316816",
    "ee": "https://archives.ismir.net/ismir2022/paper/000111.pdf",
    "pages": "925-932",
    "abstract": "The variational auto-encoder has become a leading framework for symbolic music generation, and a popular research direction is to study how to effectively control the generation process. A straightforward way is to control a model using different conditions during inference. However, in music practice, conditions are usually sequential (rather than simple categorical labels), involving rich information that overlaps with the learned representation. Consequently, the decoder gets confused about whether to listen to the latent representation or the condition, and sometimes just ignores the condition. To solve this problem, we leverage domain adversarial training to disentangle the representation from condition cues for better control. Specifically, we propose a condition corruption objective that uses the representation to denoise a corrupted condition. Minimized by a discriminator and maximized by the VAE encoder, this objective adversarially induces a condition-invariant representation. In this paper, we focus on the task of melody harmonization to illustrate our idea, while our methodology can be generalized to other controllable generative tasks. Demos and experiments show that our methodology facilitates not only condition-invariant representation learning but also higher-quality controllability compared to baselines.",
    "zenodo_id": 7316816,
    "dblp_key": null
  },
  {
    "title": "Modeling perceptual loudness of piano tone: theory and applications",
    "author": [
      "Yang Qu",
      "Yutian Qin",
      "Lecheng Chao",
      "Hangkai Qian",
      "Ziyu Wang",
      "Gus Xia"
    ],
    "year": "2022",
    "doi": "10.5281/zenodo.7343094",
    "url": "https://doi.org/10.5281/zenodo.7343094",
    "ee": "https://archives.ismir.net/ismir2022/paper/000112.pdf",
    "pages": "933-940",
    "abstract": "The relationship between perceptual loudness and physical attributes of sound is an important subject in both computer music and psychoacoustics. Early studies of “equal-loudness contour” can trace back to the 1920s and the measured loudness with respect to intensity and frequency has been revised many times since then. However, most studies merely focus on synthesized sound, and the induced theories on natural tones with complex timbre has rarely been justified. To this end, we investigate both theory and applications of natural-tone loudness perception in this paper via modeling piano tone. The theory part contains: 1) an accurate measurement of piano-tone equal-loudness contour of pitches, and 2) a machine-learning model capable of inferring loudness purely based on spectral features trained on human subject measurements. As for the application, we apply our theory to piano control transfer, in which we adjust the MIDI velocities on two different player pianos (in different acoustic environments) to achieve the same perceptual effect. Experiments show that both of our theoretical loudness modeling and the corresponding performance control transfer algorithm significantly outperform their baselines.",
    "zenodo_id": 7343094,
    "dblp_key": null
  },
  {
    "title": "On the Impact and Interplay of Input Representations and Network Architectures for Automatic Music Tagging",
    "author": [
      "Maximilian Damböck",
      "Richard Vogl",
      "Peter Knees"
    ],
    "year": "2022",
    "doi": "10.5281/zenodo.7343091",
    "url": "https://doi.org/10.5281/zenodo.7343091",
    "ee": "https://archives.ismir.net/ismir2022/paper/000113.pdf",
    "pages": "941-948",
    "abstract": "Automatic music tagging systems have once more gained relevance over the last years, not least through their use in applications such as music recommender systems. State-of-the-art systems are based on a variant of convolutional neural networks (CNNs) and use some type of time-frequency audio representation as input, in a fitting combination to predict semantic tags available through expert or crowd-based annotation. In this work we systematically compare five widely used audio input representations (STFT, CQT, Mel spectrograms, MFCCs, and raw audio waveform) using five established convolutional neural network architectures (MusicCNN, VGG16, ResNet, a Squeeze and Excitation Network (SeNet), as well as a newly proposed MusicCNN variant using dilated convolutions) for the task of music tag prediction. Performance of all factor combinations are measured on two distinct tagging datasets, namely MagnaTagATune and MTG Jamendo. A two-way ANOVA shows that both input representation and model architecture significantly impact the classification results. Despite differently sized input representations and practical impact on model training, we find that using STFT as input representations provides the best results overall and on specific tag categories (genre, instrument, mood), while other representations show less consistent behavior in these regards. Furthermore, the proposed dilated convolutional architecture shows significant performance improvements for all input representations except raw waveform.",
    "zenodo_id": 7343091,
    "dblp_key": null
  }
]
